tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1614_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1614_H_
#define _PIC16LF1614_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define CCP1IF                        52
#define SSP1IF                        53
#define TXIF                          54
#define RCIF                          55
#define ADIF                          56
#define TMR1GIF                       57
#define PIR2                          58
#define CCP2IF                        59
#define TMR4IF                        60
#define TMR6IF                        61
#define BCL1IF                        62
#define C1IF                          63
#define C2IF                          64
#define PIR3                          65
#define CLC1IF                        66
#define CLC2IF                        67
#define ZCDIF                         68
#define CWGIF                         69
#define PIR4                          70
#define SMT1IF                        71
#define SMT1PRAIF                     72
#define SMT1PWAIF                     73
#define SMT2IF                        74
#define SMT2PRAIF                     75
#define SMT2PWAIF                     76
#define CRCIF                         77
#define SCANIF                        78
#define PIR5                          79
#define PID1DIF                       80
#define PID1EIF                       81
#define AT1IF                         82
#define TMR5IF                        83
#define TMR5GIF                       84
#define TMR3IF                        85
#define TMR3GIF                       86
#define TMR0                          87
#define TMR1L                         88
#define TMR1H                         89
#define T1CON                         90
#define TMR1ON                        91
#define nT1SYNC                       92
#define T1CKPS0                       93
#define T1CKPS                        94
#define T1CKPS1                       95
#define TMR1CS0                       96
#define TMR1CS                        97
#define TMR1CS1                       98
#define T1GCON                        99
#define T1GSS0                        100
#define T1GSS                         101
#define T1GSS1                        102
#define T1GVAL                        103
#define T1GGO_nDONE                   104
#define T1GSPM                        105
#define T1GTM                         106
#define T1GPOL                        107
#define TMR1GE                        108
#define T2TMR                         109
#define TMR2                          110
#define T2TMR_TMR                     111
#define T2PR                          112
#define T2PR_PR                       113
#define T2CON                         114
#define T2OUTPS0                      115
#define T2CON_OUTPS0                  116
#define T2OUTPS                       117
#define T2CON_OUTPS                   118
#define T2OUTPS1                      119
#define T2CON_OUTPS1                  120
#define T2OUTPS2                      121
#define T2CON_OUTPS2                  122
#define T2OUTPS3                      123
#define T2CON_OUTPS3                  124
#define T2CKPS0                       125
#define T2CON_CKPS                    126
#define T2CKPS                        127
#define T2CON_CKPS0                   128
#define T2CKPS1                       129
#define T2CON_CKPS1                   130
#define T2CKPS2                       131
#define T2CON_CKPS2                   132
#define T2CON_ON                      133
#define TMR2ON                        134
#define T2ON                          135
#define T2HLT                         136
#define T2HLT_MODE                    137
#define T2MODE                        138
#define T2MODE0                       139
#define T2HLT_MODE0                   140
#define T2MODE1                       141
#define T2HLT_MODE1                   142
#define T2MODE2                       143
#define T2HLT_MODE2                   144
#define T2MODE3                       145
#define T2HLT_MODE3                   146
#define T2MODE4                       147
#define T2HLT_MODE4                   148
#define T2HLT_CKSYNC                  149
#define T2CKSYNC                      150
#define T2HLT_CKPOL                   151
#define T2CKPOL                       152
#define T2PSYNC                       153
#define T2HLT_PSYNC                   154
#define T2CLKCON                      155
#define T2CS                          156
#define T2CS0                         157
#define T2CLKCON_CS                   158
#define T2CLKCON_CS0                  159
#define T2CS1                         160
#define T2CLKCON_CS1                  161
#define T2CS2                         162
#define T2CLKCON_CS2                  163
#define T2CS3                         164
#define T2CLKCON_CS3                  165
#define T2RST                         166
#define T2RSEL0                       167
#define T2RST_RSEL                    168
#define T2RSEL                        169
#define T2RST_RSEL0                   170
#define T2RSEL1                       171
#define T2RST_RSEL1                   172
#define T2RST_RSEL2                   173
#define T2RSEL2                       174
#define T2RSEL3                       175
#define T2RST_RSEL3                   176
#define TRISA                         177
#define TRISA0                        178
#define TRISA1                        179
#define TRISA2                        180
#define TRISA3                        181
#define TRISA4                        182
#define TRISA5                        183
#define TRISC                         184
#define TRISC0                        185
#define TRISC1                        186
#define TRISC2                        187
#define TRISC3                        188
#define TRISC4                        189
#define TRISC5                        190
#define PIE1                          191
#define TMR1IE                        192
#define TMR2IE                        193
#define CCP1IE                        194
#define SSP1IE                        195
#define TXIE                          196
#define RCIE                          197
#define ADIE                          198
#define TMR1GIE                       199
#define PIE2                          200
#define CCP2IE                        201
#define TMR4IE                        202
#define TMR6IE                        203
#define BCL1IE                        204
#define C1IE                          205
#define C2IE                          206
#define PIE3                          207
#define CLC1IE                        208
#define CLC2IE                        209
#define ZCDIE                         210
#define CWGIE                         211
#define PIE4                          212
#define SMT1IE                        213
#define SMT1PRAIE                     214
#define SMT1PWAIE                     215
#define SMT2IE                        216
#define SMT2PRAIE                     217
#define SMT2PWAIE                     218
#define CRCIE                         219
#define SCANIE                        220
#define PIE5                          221
#define PID1DIE                       222
#define PID1EIE                       223
#define AT1IE                         224
#define TMR5IE                        225
#define TMR5GIE                       226
#define TMR3IE                        227
#define TMR3GIE                       228
#define OPTION_REG                    229
#define OPTION_REG_PS                 230
#define OPTION_REG_PS0                231
#define OPTION_REG_PS1                232
#define PS2                           233
#define PSA                           234
#define T0SE                          235
#define TMR0SE                        236
#define T0CS                          237
#define TMR0CS                        238
#define INTEDG                        239
#define nWPUEN                        240
#define PCON                          241
#define nBOR                          242
#define nPOR                          243
#define nRI                           244
#define nRMCLR                        245
#define nRWDT                         246
#define nWDTWV                        247
#define STKUNF                        248
#define STKOVF                        249
#define OSCTUNE                       250
#define TUN0                          251
#define TUN                           252
#define TUN1                          253
#define TUN2                          254
#define TUN3                          255
#define TUN4                          256
#define TUN5                          257
#define OSCCON                        258
#define SCS0                          259
#define SCS                           260
#define SCS1                          261
#define IRCF                          262
#define IRCF0                         263
#define IRCF1                         264
#define IRCF2                         265
#define IRCF3                         266
#define SPLLEN                        267
#define OSCSTAT                       268
#define HFIOFS                        269
#define LFIOFR                        270
#define MFIOFR                        271
#define HFIOFL                        272
#define HFIOFR                        273
#define PLLR                          274
#define ADRESL                        275
#define ADRESH                        276
#define ADCON0                        277
#define ADON                          278
#define GO_nDONE                      279
#define GO                            280
#define ADGO                          281
#define CHS0                          282
#define CHS                           283
#define CHS1                          284
#define CHS2                          285
#define CHS3                          286
#define CHS4                          287
#define ADCON1                        288
#define ADPREF0                       289
#define ADPREF                        290
#define ADPREF1                       291
#define ADCS0                         292
#define ADCS                          293
#define ADCS1                         294
#define ADCS2                         295
#define ADFM                          296
#define ADCON2                        297
#define TRIGSEL                       298
#define TRIGSEL0                      299
#define TRIGSEL1                      300
#define TRIGSEL2                      301
#define TRIGSEL3                      302
#define LATA                          303
#define LATA0                         304
#define LATA1                         305
#define LATA2                         306
#define LATA3                         307
#define LATA4                         308
#define LATA5                         309
#define LATC                          310
#define LATC0                         311
#define LATC1                         312
#define LATC2                         313
#define LATC3                         314
#define LATC4                         315
#define LATC5                         316
#define CM1CON0                       317
#define C1SYNC                        318
#define C1HYS                         319
#define C1SP                          320
#define C1POL                         321
#define C1OUT                         322
#define C1ON                          323
#define CM1CON1                       324
#define C1NCH0                        325
#define C1NCH                         326
#define C1NCH1                        327
#define C1NCH2                        328
#define C1PCH                         329
#define C1PCH0                        330
#define C1PCH1                        331
#define C1INTN                        332
#define C1INTP                        333
#define CM2CON0                       334
#define C2SYNC                        335
#define C2HYS                         336
#define C2SP                          337
#define C2POL                         338
#define C2OUT                         339
#define C2ON                          340
#define CM2CON1                       341
#define C2NCH0                        342
#define C2NCH                         343
#define C2NCH1                        344
#define C2NCH2                        345
#define C2PCH                         346
#define C2PCH0                        347
#define C2PCH1                        348
#define C2INTN                        349
#define C2INTP                        350
#define CMOUT                         351
#define MC1OUT                        352
#define MC2OUT                        353
#define BORCON                        354
#define BORRDY                        355
#define BORFS                         356
#define SBOREN                        357
#define FVRCON                        358
#define ADFVR0                        359
#define ADFVR                         360
#define ADFVR1                        361
#define CDAFVR                        362
#define CDAFVR0                       363
#define CDAFVR1                       364
#define TSRNG                         365
#define TSEN                          366
#define FVRRDY                        367
#define FVREN                         368
#define DAC1CON0                      369
#define DAC1PSS                       370
#define D1PSS0                        371
#define D1PSS1                        372
#define DAC1OE                        373
#define DAC1EN                        374
#define DAC1CON1                      375
#define DAC1R                         376
#define DAC1R0                        377
#define DAC1R1                        378
#define DAC1R2                        379
#define DAC1R3                        380
#define DAC1R4                        381
#define DAC1R5                        382
#define DAC1R6                        383
#define DAC1R7                        384
#define ZCD1CON                       385
#define ZCD1INTN                      386
#define ZCD1INTP                      387
#define ZCD1POL                       388
#define ZCD1OUT                       389
#define ZCD1EN                        390
#define ANSA0                         391
#define ANSELA                        392
#define ANSA1                         393
#define ANSA2                         394
#define ANSA4                         395
#define ANSC0                         396
#define ANSELC                        397
#define ANSC1                         398
#define ANSC2                         399
#define ANSC3                         400
#define PMADRL                        401
#define PMADRH                        402
#define PMDATL                        403
#define PMDATH                        404
#define PMCON1                        405
#define RD                            406
#define WR                            407
#define WREN                          408
#define WRERR                         409
#define FREE                          410
#define LWLO                          411
#define CFGS                          412
#define PMCON2                        413
#define RC1REG                        414
#define TX1REG                        415
#define SP1BRGL                       416
#define SP1BRGH                       417
#define RC1STA                        418
#define RX9D                          419
#define OERR                          420
#define FERR                          421
#define ADDEN                         422
#define CREN                          423
#define SREN                          424
#define RX9                           425
#define SPEN                          426
#define TX1STA                        427
#define TX9D                          428
#define TRMT                          429
#define BRGH                          430
#define SENDB                         431
#define SYNC                          432
#define TXEN                          433
#define TX9                           434
#define CSRC                          435
#define BAUD1CON                      436
#define ABDEN                         437
#define WUE                           438
#define BRG16                         439
#define SCKP                          440
#define RCIDL                         441
#define ABDOVF                        442
#define WPUA                          443
#define WPUA0                         444
#define WPUA_WPUA                     445
#define WPUA1                         446
#define WPUA2                         447
#define WPUA3                         448
#define WPUA4                         449
#define WPUA5                         450
#define WPUC                          451
#define WPUC0                         452
#define WPUC_WPUA                     453
#define WPUC1                         454
#define WPUC2                         455
#define WPUC3                         456
#define WPUC4                         457
#define WPUC5                         458
#define SSP1BUF                       459
#define BUF                           460
#define BUF0                          461
#define SSP1BUF0                      462
#define BUF1                          463
#define SSP1BUF1                      464
#define BUF2                          465
#define SSP1BUF2                      466
#define BUF3                          467
#define SSP1BUF3                      468
#define BUF4                          469
#define SSP1BUF4                      470
#define BUF5                          471
#define SSP1BUF5                      472
#define BUF6                          473
#define SSP1BUF6                      474
#define BUF7                          475
#define SSP1BUF7                      476
#define ADD0                          477
#define ADD                           478
#define SSP1ADD0                      479
#define SSP1ADD                       480
#define ADD1                          481
#define SSP1ADD1                      482
#define ADD2                          483
#define SSP1ADD2                      484
#define ADD3                          485
#define SSP1ADD3                      486
#define ADD4                          487
#define SSP1ADD4                      488
#define ADD5                          489
#define SSP1ADD5                      490
#define ADD6                          491
#define SSP1ADD6                      492
#define ADD7                          493
#define SSP1ADD7                      494
#define SSP1MSK0                      495
#define SSP1MSK                       496
#define MSK0                          497
#define MSK                           498
#define SSP1MSK1                      499
#define MSK1                          500
#define SSP1MSK2                      501
#define MSK2                          502
#define SSP1MSK3                      503
#define MSK3                          504
#define SSP1MSK4                      505
#define MSK4                          506
#define SSP1MSK5                      507
#define MSK5                          508
#define SSP1MSK6                      509
#define MSK6                          510
#define SSP1MSK7                      511
#define MSK7                          512
#define SSP1STAT                      513
#define BF                            514
#define UA                            515
#define R_nW                          516
#define S                             517
#define P                             518
#define D_nA                          519
#define CKE                           520
#define SMP                           521
