tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1614_tdd.h
#define SSP1CON1                      522
#define SSPM0                         523
#define SSPM                          524
#define SSPM1                         525
#define SSPM2                         526
#define SSPM3                         527
#define CKP                           528
#define SSPEN                         529
#define SSPOV                         530
#define WCOL                          531
#define SSP1CON2                      532
#define SSP1CON2_SEN                  533
#define RSEN                          534
#define PEN                           535
#define RCEN                          536
#define ACKEN                         537
#define ACKDT                         538
#define ACKSTAT                       539
#define GCEN                          540
#define SSP1CON3                      541
#define DHEN                          542
#define AHEN                          543
#define SBCDE                         544
#define SDAHT                         545
#define BOEN                          546
#define SCIE                          547
#define PCIE                          548
#define ACKTIM                        549
#define ODCONA                        550
#define ODA0                          551
#define ODA1                          552
#define ODA2                          553
#define ODA4                          554
#define ODA5                          555
#define ODCONC                        556
#define ODC0                          557
#define ODC1                          558
#define ODC2                          559
#define ODC3                          560
#define ODC4                          561
#define ODC5                          562
#define CCPR1L                        563
#define CCPR1L_RL                     564
#define CCPR1H                        565
#define CCPR1H_RH                     566
#define CCP1CON                       567
#define CCP1MODE0                     568
#define CCP1CON_MODE0                 569
#define CCP1CON_MODE                  570
#define CCP1MODE                      571
#define CCP1MODE1                     572
#define CCP1CON_MODE1                 573
#define CCP1MODE2                     574
#define CCP1CON_MODE2                 575
#define CCP1MODE3                     576
#define CCP1CON_MODE3                 577
#define CCP1CON_FMT                   578
#define CCP1FMT                       579
#define CCP1CON_OUT                   580
#define CCP1OUT                       581
#define CCP1EN                        582
#define CCP1CON_EN                    583
#define CCP1CAP                       584
#define CCP1CTS0                      585
#define CCP1CAP_CTS                   586
#define CCP1CAP_CTS0                  587
#define CCP1CTS                       588
#define CCP1CTS1                      589
#define CCP1CAP_CTS1                  590
#define CCP1CTS2                      591
#define CCP1CAP_CTS2                  592
#define CCPR2L                        593
#define CCPR2L_RL                     594
#define CCPR2H                        595
#define CCPR2H_RH                     596
#define CCP2CON                       597
#define CCP2MODE                      598
#define CCP2MODE0                     599
#define CCP2CON_MODE0                 600
#define CCP2CON_MODE                  601
#define CCP2MODE1                     602
#define CCP2CON_MODE1                 603
#define CCP2MODE2                     604
#define CCP2CON_MODE2                 605
#define CCP2MODE3                     606
#define CCP2CON_MODE3                 607
#define CCP2FMT                       608
#define CCP2CON_FMT                   609
#define CCP2OUT                       610
#define CCP2CON_OUT                   611
#define CCP2EN                        612
#define CCP2CON_EN                    613
#define CCP2CAP                       614
#define CCP2CAP_CTS                   615
#define CCP2CAP_CTS0                  616
#define CCP2CTS                       617
#define CCP2CTS0                      618
#define CCP2CAP_CTS1                  619
#define CCP2CTS1                      620
#define CCP2CAP_CTS2                  621
#define CCP2CTS2                      622
#define CCPTMRS                       623
#define CCP1TSEL0                     624
#define CCP1TSEL                      625
#define CCP1TSEL1                     626
#define CCP2TSEL0                     627
#define CCP2TSEL                      628
#define CCP2TSEL1                     629
#define P3TSEL                        630
#define P3TSEL0                       631
#define P3TSEL1                       632
#define P4TSEL0                       633
#define P4TSEL                        634
#define P4TSEL1                       635
#define SLRCONA                       636
#define SLRA0                         637
#define SLRA1                         638
#define SLRA2                         639
#define SLRA4                         640
#define SLRA5                         641
#define SLRCONC                       642
#define SLRC0                         643
#define SLRC1                         644
#define SLRC2                         645
#define SLRC3                         646
#define SLRC4                         647
#define SLRC5                         648
#define INLVLA                        649
#define INLVLA0                       650
#define INLVLA1                       651
#define INLVLA2                       652
#define INLVLA3                       653
#define INLVLA4                       654
#define INLVLA5                       655
#define INLVLC                        656
#define INLVLC0                       657
#define INLVLC1                       658
#define INLVLC2                       659
#define INLVLC3                       660
#define INLVLC4                       661
#define INLVLC5                       662
#define IOCAP                         663
#define IOCAP0                        664
#define IOCAP1                        665
#define IOCAP2                        666
#define IOCAP3                        667
#define IOCAP4                        668
#define IOCAP5                        669
#define IOCAN0                        670
#define IOCAN                         671
#define IOCAN1                        672
#define IOCAN2                        673
#define IOCAN3                        674
#define IOCAN4                        675
#define IOCAN5                        676
#define IOCAF0                        677
#define IOCAF                         678
#define IOCAF1                        679
#define IOCAF2                        680
#define IOCAF3                        681
#define IOCAF4                        682
#define IOCAF5                        683
#define IOCCP                         684
#define IOCCP0                        685
#define IOCCP1                        686
#define IOCCP2                        687
#define IOCCP3                        688
#define IOCCP4                        689
#define IOCCP5                        690
#define IOCCN                         691
#define IOCCN0                        692
#define IOCCN1                        693
#define IOCCN2                        694
#define IOCCN3                        695
#define IOCCN4                        696
#define IOCCN5                        697
#define IOCCF                         698
#define IOCCF0                        699
#define IOCCF1                        700
#define IOCCF2                        701
#define IOCCF3                        702
#define IOCCF4                        703
#define IOCCF5                        704
#define HIDRVC                        705
#define HIDC4                         706
#define HIDC5                         707
#define T4TMR                         708
#define TMR4                          709
#define T4TMR_TMR                     710
#define T4PR_PR                       711
#define T4PR                          712
#define T4CON                         713
#define T4OUTPS0                      714
#define T4CON_OUTPS                   715
#define T4OUTPS                       716
#define T4CON_OUTPS0                  717
#define T4OUTPS1                      718
#define T4CON_OUTPS1                  719
#define T4CON_OUTPS2                  720
#define T4OUTPS2                      721
#define T4OUTPS3                      722
#define T4CON_OUTPS3                  723
#define T4CON_CKPS0                   724
#define T4CKPS0                       725
#define T4CON_CKPS                    726
#define T4CKPS                        727
#define T4CKPS1                       728
#define T4CON_CKPS1                   729
#define T4CKPS2                       730
#define T4CON_CKPS2                   731
#define T4ON                          732
#define T4CON_ON                      733
#define TMR4ON                        734
#define T4HLT                         735
#define T4MODE                        736
#define T4HLT_MODE                    737
#define T4HLT_MODE0                   738
#define T4MODE0                       739
#define T4HLT_MODE1                   740
#define T4MODE1                       741
#define T4HLT_MODE2                   742
#define T4MODE2                       743
#define T4HLT_MODE3                   744
#define T4MODE3                       745
#define T4HLT_MODE4                   746
#define T4MODE4                       747
#define T4CKSYNC                      748
#define T4HLT_CKSYNC                  749
#define T4HLT_CKPOL                   750
#define T4CKPOL                       751
#define T4PSYNC                       752
#define T4HLT_PSYNC                   753
#define T4CLKCON                      754
#define T4CS                          755
#define T4CLKCON_CS                   756
#define T4CS0                         757
#define T4CLKCON_CS0                  758
#define T4CS1                         759
#define T4CLKCON_CS1                  760
#define T4CS2                         761
#define T4CLKCON_CS2                  762
#define T4CS3                         763
#define T4CLKCON_CS3                  764
#define T4RST                         765
#define T4RSEL0                       766
#define T4RSEL                        767
#define T4RST_RSEL                    768
#define T4RST_RSEL0                   769
#define T4RSEL1                       770
#define T4RST_RSEL1                   771
#define T4RSEL2                       772
#define T4RST_RSEL2                   773
#define T4RSEL3                       774
#define T4RST_RSEL3                   775
#define T6TMR                         776
#define TMR6                          777
#define T6TMR_TMR                     778
#define T6PR_PR                       779
#define T6PR                          780
#define T6CON                         781
#define T6CON_OUTPS0                  782
#define T6OUTPS                       783
#define T6CON_OUTPS                   784
#define T6OUTPS0                      785
#define T6CON_OUTPS1                  786
#define T6OUTPS1                      787
#define T6CON_OUTPS2                  788
#define T6OUTPS2                      789
#define T6CON_OUTPS3                  790
#define T6OUTPS3                      791
#define T6CON_CKPS0                   792
#define T6CKPS                        793
#define T6CKPS0                       794
#define T6CON_CKPS                    795
#define T6CON_CKPS1                   796
#define T6CKPS1                       797
#define T6CON_CKPS2                   798
#define T6CKPS2                       799
#define TMR6ON                        800
#define T6ON                          801
#define T6CON_ON                      802
#define T6HLT                         803
#define T6MODE0                       804
#define T6HLT_MODE0                   805
#define T6HLT_MODE                    806
#define T6MODE                        807
#define T6HLT_MODE1                   808
#define T6MODE1                       809
#define T6HLT_MODE2                   810
#define T6MODE2                       811
#define T6HLT_MODE3                   812
#define T6MODE3                       813
#define T6MODE4                       814
#define T6HLT_MODE4                   815
#define T6CKSYNC                      816
#define T6HLT_CKSYNC                  817
#define T6CKPOL                       818
#define T6HLT_CKPOL                   819
#define T6PSYNC                       820
#define T6HLT_PSYNC                   821
#define T6CLKCON                      822
#define T6CS                          823
#define T6CLKCON_CS                   824
#define T6CLKCON_CS0                  825
#define T6CS0                         826
#define T6CLKCON_CS1                  827
#define T6CS1                         828
#define T6CLKCON_CS2                  829
#define T6CS2                         830
#define T6CLKCON_CS3                  831
#define T6CS3                         832
#define T6RST                         833
#define T6RST_RSEL                    834
#define T6RST_RSEL0                   835
#define T6RSEL                        836
#define T6RSEL0                       837
#define T6RST_RSEL1                   838
#define T6RSEL1                       839
#define T6RSEL2                       840
#define T6RST_RSEL2                   841
#define T6RST_RSEL3                   842
#define T6RSEL3                       843
#define TMR3L                         844
#define TMR3H                         845
#define T3CON                         846
#define TMR3ON                        847
#define T3SYNC                        848
#define T3CKPS                        849
#define T3CKPS0                       850
#define T3CKPS1                       851
#define TMR3CS0                       852
#define TMR3CS                        853
#define TMR3CS1                       854
#define T3GCON                        855
#define T3GSS0                        856
#define T3GSS                         857
#define T3GSS1                        858
#define T3GVAL                        859
#define T3GGO_nDONE                   860
#define T3GSPM                        861
#define T3GTM                         862
#define T3GPOL                        863
#define TMR3GE                        864
#define TMR5L                         865
#define TMR5H                         866
#define T5CON                         867
#define TMR5ON                        868
#define T5SYNC                        869
#define T5CKPS                        870
#define T5CKPS0                       871
#define T5CKPS1                       872
#define TMR5CS0                       873
#define TMR5CS                        874
#define TMR5CS1                       875
#define T5GCON                        876
#define T5GSS                         877
#define T5GSS0                        878
#define T5GSS1                        879
#define T5GVAL                        880
#define T5GGO_nDONE                   881
#define T5GSPM                        882
#define T5GTM                         883
#define T5GPOL                        884
#define TMR5GE                        885
#define PID1SETL                      886
#define PID1SET0                      887
#define SET0                          888
#define PID1SET1                      889
#define SET1                          890
#define SET2                          891
#define PID1SET2                      892
#define SET3                          893
#define PID1SET3                      894
#define SET4                          895
#define PID1SET4                      896
#define SET5                          897
#define PID1SET5                      898
#define SET6                          899
#define PID1SET6                      900
#define SET7                          901
#define PID1SET7                      902
#define PID1SETH                      903
#define SET8                          904
#define PID1SET8                      905
#define SET9                          906
#define PID1SET9                      907
#define SET10                         908
#define PID1SET10                     909
#define SET11                         910
#define PID1SET11                     911
#define SET12                         912
#define PID1SET12                     913
#define SET13                         914
#define PID1SET13                     915
#define SET14                         916
#define PID1SET14                     917
#define SET15                         918
#define PID1SET15                     919
#define PID1INL                       920
#define IN0                           921
#define PID1IN0                       922
#define IN1                           923
#define PID1IN1                       924
#define IN2                           925
#define PID1IN2                       926
#define IN3                           927
#define PID1IN3                       928
#define IN4                           929
#define PID1IN4                       930
#define IN5                           931
#define PID1IN5                       932
#define IN6                           933
#define PID1IN6                       934
#define IN7                           935
#define PID1IN7                       936
#define PID1INH                       937
#define IN8                           938
#define PID1IN8                       939
#define IN9                           940
#define PID1IN9                       941
#define PID1IN10                      942
#define IN10                          943
#define PID1IN11                      944
#define IN11                          945
#define PID1IN12                      946
#define IN12                          947
#define PID1IN13                      948
#define IN13                          949
#define PID1IN14                      950
#define IN14                          951
#define IN15                          952
#define PID1IN15                      953
#define PID1K1L                       954
#define K10                           955
#define PID1K10                       956
#define K11                           957
#define PID1K11                       958
#define K12                           959
#define PID1K12                       960
#define K13                           961
#define PID1K13                       962
#define K14                           963
#define PID1K14                       964
#define K15                           965
#define PID1K15                       966
#define K16                           967
#define PID1K16                       968
#define K17                           969
#define PID1K17                       970
#define PID1K1H                       971
#define K18                           972
#define PID1K18                       973
#define K19                           974
#define PID1K19                       975
#define PID1K110                      976
#define K110                          977
#define PID1K111                      978
#define K111                          979
#define PID1K112                      980
#define K112                          981
#define PID1K113                      982
#define K113                          983
#define PID1K114                      984
#define K114                          985
#define PID1K115                      986
#define K115                          987
#define PID1K2L                       988
#define K20                           989
#define PID1K20                       990
#define K21                           991
#define PID1K21                       992
#define K22                           993
#define PID1K22                       994
#define K23                           995
#define PID1K23                       996
#define K24                           997
#define PID1K24                       998
#define K25                           999
#define PID1K25                       1000
#define K26                           1001
#define PID1K26                       1002
#define K27                           1003
#define PID1K27                       1004
#define PID1K2H                       1005
#define K28                           1006
#define PID1K28                       1007
#define K29                           1008
#define PID1K29                       1009
#define PID1K210                      1010
#define K210                          1011
#define PID1K211                      1012
#define K211                          1013
#define PID1K212                      1014
#define K212                          1015
#define PID1K213                      1016
#define K213                          1017
#define PID1K214                      1018
#define K214                          1019
#define PID1K215                      1020
#define K215                          1021
#define PID1K3L                       1022
#define K30                           1023
#define PID1K30                       1024
#define K31                           1025
#define PID1K31                       1026
#define K32                           1027
#define PID1K32                       1028
#define K33                           1029
#define PID1K33                       1030
#define K34                           1031
#define PID1K34                       1032
#define K35                           1033
#define PID1K35                       1034
#define K36                           1035
#define PID1K36                       1036
#define K37                           1037
#define PID1K37                       1038
#define PID1K3H                       1039
#define K38                           1040
#define PID1K38                       1041
#define PID1K39                       1042
#define K39                           1043
#define K310                          1044
#define PID1K310                      1045
#define K311                          1046
#define PID1K311                      1047
#define K312                          1048
#define PID1K312                      1049
#define K313                          1050
#define PID1K313                      1051
#define K314                          1052
#define PID1K314                      1053
#define K315                          1054
#define PID1K315                      1055
#define PID1OUTLL                     1056
#define OUT0                          1057
#define PID1OUT0                      1058
#define OUT1                          1059
#define PID1OUT1                      1060
#define OUT2                          1061
#define PID1OUT2                      1062
#define OUT3                          1063
#define PID1OUT3                      1064
#define OUT4                          1065
#define PID1OUT4                      1066
#define OUT5                          1067
#define PID1OUT5                      1068
#define OUT6                          1069
#define PID1OUT6                      1070
#define OUT7                          1071
#define PID1OUT7                      1072
#define PID1OUTLH                     1073
#define OUT8                          1074
#define PID1OUT8                      1075
#define OUT9                          1076
#define PID1OUT9                      1077
#define PID1OUT10                     1078
#define OUT10                         1079
#define PID1OUT11                     1080
#define OUT11                         1081
#define OUT12                         1082
#define PID1OUT12                     1083
#define OUT13                         1084
#define PID1OUT13                     1085
#define PID1OUT14                     1086
#define OUT14                         1087
#define PID1OUT15                     1088
#define OUT15                         1089
#define PID1OUTHL                     1090
