tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1614_tdd.h
#define PID1OUT16                     1091
#define OUT16                         1092
#define PID1OUT17                     1093
#define OUT17                         1094
#define OUT18                         1095
#define PID1OUT18                     1096
#define OUT19                         1097
#define PID1OUT19                     1098
#define OUT20                         1099
#define PID1OUT20                     1100
#define OUT21                         1101
#define PID1OUT21                     1102
#define OUT22                         1103
#define PID1OUT22                     1104
#define OUT23                         1105
#define PID1OUT23                     1106
#define PID1OUTHH                     1107
#define OUT24                         1108
#define PID1OUT24                     1109
#define OUT25                         1110
#define PID1OUT25                     1111
#define OUT26                         1112
#define PID1OUT26                     1113
#define OUT27                         1114
#define PID1OUT27                     1115
#define OUT28                         1116
#define PID1OUT28                     1117
#define OUT29                         1118
#define PID1OUT29                     1119
#define PID1OUT30                     1120
#define OUT30                         1121
#define OUT31                         1122
#define PID1OUT31                     1123
#define PID1OUTU                      1124
#define OUT32                         1125
#define PID1OUT32                     1126
#define OUT33                         1127
#define PID1OUT33                     1128
#define OUT34                         1129
#define PID1OUT34                     1130
#define OUT35                         1131
#define PID1OUT35                     1132
#define PID1Z1L                       1133
#define PID1Z10                       1134
#define Z10                           1135
#define PID1Z11                       1136
#define Z11                           1137
#define PID1Z12                       1138
#define Z12                           1139
#define PID1Z13                       1140
#define Z13                           1141
#define PID1Z14                       1142
#define Z14                           1143
#define PID1Z15                       1144
#define Z15                           1145
#define PID1Z16                       1146
#define Z16                           1147
#define PID1Z17                       1148
#define Z17                           1149
#define PID1Z1H                       1150
#define Z18                           1151
#define PID1Z18                       1152
#define Z19                           1153
#define PID1Z19                       1154
#define Z110                          1155
#define PID1Z110                      1156
#define Z111                          1157
#define PID1Z111                      1158
#define Z112                          1159
#define PID1Z112                      1160
#define Z113                          1161
#define PID1Z113                      1162
#define Z114                          1163
#define PID1Z114                      1164
#define Z115                          1165
#define PID1Z115                      1166
#define PID1Z1U                       1167
#define Z116                          1168
#define PID1Z116                      1169
#define PID1Z2L                       1170
#define Z20                           1171
#define PID1Z20                       1172
#define Z21                           1173
#define PID1Z21                       1174
#define Z22                           1175
#define PID1Z22                       1176
#define Z23                           1177
#define PID1Z23                       1178
#define Z24                           1179
#define PID1Z24                       1180
#define Z25                           1181
#define PID1Z25                       1182
#define Z26                           1183
#define PID1Z26                       1184
#define Z27                           1185
#define PID1Z27                       1186
#define PID1Z2H                       1187
#define Z28                           1188
#define PID1Z28                       1189
#define Z29                           1190
#define PID1Z29                       1191
#define PID1Z210                      1192
#define Z210                          1193
#define PID1Z211                      1194
#define Z211                          1195
#define PID1Z212                      1196
#define Z212                          1197
#define PID1Z213                      1198
#define Z213                          1199
#define PID1Z214                      1200
#define Z214                          1201
#define PID1Z215                      1202
#define Z215                          1203
#define PID1Z2U                       1204
#define PID1Z216                      1205
#define Z216                          1206
#define PID1ACCLL                     1207
#define PID1ACCLL_ACC0                1208
#define PID1ACC0                      1209
#define PID1ACCLL_ACC1                1210
#define PID1ACC1                      1211
#define PID1ACCLL_ACC2                1212
#define PID1ACC2                      1213
#define PID1ACCLL_ACC3                1214
#define PID1ACC3                      1215
#define PID1ACCLL_ACC4                1216
#define PID1ACC4                      1217
#define PID1ACCLL_ACC5                1218
#define PID1ACC5                      1219
#define PID1ACCLL_ACC6                1220
#define PID1ACC6                      1221
#define PID1ACCLL_ACC7                1222
#define PID1ACC7                      1223
#define PID1ACCLH                     1224
#define PID1ACCLH_ACC8                1225
#define PID1ACC8                      1226
#define PID1ACCLH_ACC9                1227
#define PID1ACC9                      1228
#define PID1ACC10                     1229
#define PID1ACCLH_ACC10               1230
#define PID1ACC11                     1231
#define PID1ACCLH_ACC11               1232
#define PID1ACC12                     1233
#define PID1ACCLH_ACC12               1234
#define PID1ACC13                     1235
#define PID1ACCLH_ACC13               1236
#define PID1ACC14                     1237
#define PID1ACCLH_ACC14               1238
#define PID1ACC15                     1239
#define PID1ACCLH_ACC15               1240
#define PID1ACCHL                     1241
#define PID1ACC16                     1242
#define ACC16                         1243
#define PID1ACC17                     1244
#define ACC17                         1245
#define PID1ACC18                     1246
#define ACC18                         1247
#define PID1ACC19                     1248
#define ACC19                         1249
#define ACC20                         1250
#define PID1ACC20                     1251
#define ACC21                         1252
#define PID1ACC21                     1253
#define ACC22                         1254
#define PID1ACC22                     1255
#define ACC23                         1256
#define PID1ACC23                     1257
#define PID1ACCHH                     1258
#define ACC24                         1259
#define PID1ACC24                     1260
#define ACC25                         1261
#define PID1ACC25                     1262
#define ACC26                         1263
#define PID1ACC26                     1264
#define ACC27                         1265
#define PID1ACC27                     1266
#define ACC28                         1267
#define PID1ACC28                     1268
#define ACC29                         1269
#define PID1ACC29                     1270
#define PID1ACC30                     1271
#define ACC30                         1272
#define ACC31                         1273
#define PID1ACC31                     1274
#define PID1ACCU                      1275
#define ACC32                         1276
#define PID1ACC32                     1277
#define ACC33                         1278
#define PID1ACC33                     1279
#define PID1ACC34                     1280
#define ACC34                         1281
#define PID1CON                       1282
#define PID1CON_MODE0                 1283
#define PID1MODE0                     1284
#define PID1CON_MODE                  1285
#define PID1MODE                      1286
#define PID1CON_MODE1                 1287
#define PID1MODE1                     1288
#define PID1CON_MODE2                 1289
#define PID1MODE2                     1290
#define PID1CON_BUSY                  1291
#define PID1BUSY                      1292
#define PID1EN                        1293
#define PID1CON_EN                    1294
#define PWM3DCL                       1295
#define PWM3DC0                       1296
#define PWM3DCL_PWMPW0                1297
#define PWM3DCL_DC0                   1298
#define PWM3DCL_DC                    1299
#define PWM3DC1                       1300
#define PWM3DCL_PWMPW1                1301
#define PWM3DCL_DC1                   1302
#define PWM3DCH                       1303
#define PWM3DC2                       1304
#define PWM3DCH_DC2                   1305
#define PWM3DCH_DC                    1306
#define PWM3DCH_PWMPW2                1307
#define PWM3DC3                       1308
#define PWM3DCH_DC3                   1309
#define PWM3DCH_PWMPW3                1310
#define PWM3DC4                       1311
#define PWM3DCH_DC4                   1312
#define PWM3DCH_PWMPW4                1313
#define PWM3DC5                       1314
#define PWM3DCH_DC5                   1315
#define PWM3DCH_PWMPW5                1316
#define PWM3DC6                       1317
#define PWM3DCH_DC6                   1318
#define PWM3DCH_PWMPW6                1319
#define PWM3DC7                       1320
#define PWM3DCH_DC7                   1321
#define PWM3DCH_PWMPW7                1322
#define PWM3DC8                       1323
#define PWM3DCH_DC8                   1324
#define PWM3DCH_PWMPW8                1325
#define PWM3DC9                       1326
#define PWM3DCH_DC9                   1327
#define PWM3DCH_PWMPW9                1328
#define PWM3CON                       1329
#define PWM3CON_POL                   1330
#define PWM3POL                       1331
#define PWM3CON_OUT                   1332
#define PWM3OUT                       1333
#define PWM3EN                        1334
#define PWM3CON_EN                    1335
#define PWM4DCL                       1336
#define PWM4DCL_PWMPW0                1337
#define PWM4DCL_DC                    1338
#define PWM4DC0                       1339
#define PWM4DCL_DC0                   1340
#define PWM4DCL_PWMPW1                1341
#define PWM4DC1                       1342
#define PWM4DCL_DC1                   1343
#define PWM4DCH                       1344
#define PWM4DCH_PWMPW2                1345
#define PWM4DCH_DC                    1346
#define PWM4DC2                       1347
#define PWM4DCH_DC2                   1348
#define PWM4DCH_PWMPW3                1349
#define PWM4DC3                       1350
#define PWM4DCH_DC3                   1351
#define PWM4DCH_PWMPW4                1352
#define PWM4DC4                       1353
#define PWM4DCH_DC4                   1354
#define PWM4DCH_PWMPW5                1355
#define PWM4DC5                       1356
#define PWM4DCH_DC5                   1357
#define PWM4DCH_PWMPW6                1358
#define PWM4DC6                       1359
#define PWM4DCH_DC6                   1360
#define PWM4DCH_PWMPW7                1361
#define PWM4DC7                       1362
#define PWM4DCH_DC7                   1363
#define PWM4DCH_PWMPW8                1364
#define PWM4DC8                       1365
#define PWM4DCH_DC8                   1366
#define PWM4DCH_PWMPW9                1367
#define PWM4DC9                       1368
#define PWM4DCH_DC9                   1369
#define PWM4CON                       1370
#define PWM4POL                       1371
#define PWM4CON_POL                   1372
#define PWM4CON_OUT                   1373
#define PWM4OUT                       1374
#define PWM4EN                        1375
#define PWM4CON_EN                    1376
#define CWG1DBR0                      1377
#define CWG1DBR                       1378
#define DBR                           1379
#define DBR0                          1380
#define CWG1DBR1                      1381
#define DBR1                          1382
#define CWG1DBR2                      1383
#define DBR2                          1384
#define CWG1DBR3                      1385
#define DBR3                          1386
#define CWG1DBR4                      1387
#define DBR4                          1388
#define CWG1DBR5                      1389
#define DBR5                          1390
#define CWG1DBF                       1391
#define CWG1DBF0                      1392
#define DBF                           1393
#define DBF0                          1394
#define CWG1DBF1                      1395
#define DBF1                          1396
#define CWG1DBF2                      1397
#define DBF2                          1398
#define CWG1DBF3                      1399
#define DBF3                          1400
#define CWG1DBF4                      1401
#define DBF4                          1402
#define DBF5                          1403
#define CWG1DBF5                      1404
#define CWG1AS0                       1405
#define CWG1LSAC                      1406
#define LSAC                          1407
#define LSAC0                         1408
#define CWG1LSAC0                     1409
#define LSAC1                         1410
#define CWG1LSAC1                     1411
#define LSBD0                         1412
#define CWG1LSBD0                     1413
#define LSBD                          1414
#define CWG1LSBD                      1415
#define LSBD1                         1416
#define CWG1LSBD1                     1417
#define CWG1REN                       1418
#define REN                           1419
#define CWG1SHUTDOWN                  1420
#define SHUTDOWN                      1421
#define CWG1AS1                       1422
#define INAS                          1423
#define CWG1INAS                      1424
#define C1AS                          1425
#define CWG1C1AS                      1426
#define C2AS                          1427
#define CWG1C2AS                      1428
#define TMR2AS                        1429
#define CWG1TMR2AS                    1430
#define CWG1TMR4AS                    1431
#define TMR4AS                        1432
#define CWG1TMR6AS                    1433
#define TMR6AS                        1434
#define CWG1OCON0                     1435
#define CWG1STRA                      1436
#define STRA                          1437
#define STRB                          1438
#define CWG1STRB                      1439
#define CWG1STRC                      1440
#define STRC                          1441
#define CWG1STRD                      1442
#define STRD                          1443
#define OVRA                          1444
#define CWG1OVRA                      1445
#define CWG1OVRB                      1446
#define OVRB                          1447
#define OVRC                          1448
#define CWG1OVRC                      1449
#define OVRD                          1450
#define CWG1OVRD                      1451
#define CWG1CON0                      1452
#define CWG1MODE0                     1453
#define CWG1CON0_MODE0                1454
#define CWG1MODE                      1455
#define CWG1CON0_MODE                 1456
#define CWG1MODE1                     1457
#define CWG1CON0_MODE1                1458
#define CWG1MODE2                     1459
#define CWG1CON0_MODE2                1460
#define LD                            1461
#define CWG1LD                        1462
#define CWG1CON0_EN                   1463
#define CWG1EN                        1464
#define G1EN                          1465
#define CWG1CON1                      1466
#define CWG1POLA                      1467
#define POLA                          1468
#define CWG1POLB                      1469
#define POLB                          1470
#define CWG1POLC                      1471
#define POLC                          1472
#define CWG1POLD                      1473
#define POLD                          1474
#define IN                            1475
#define CWG1IN                        1476
#define CWG1CLKCON                    1477
#define CWG1CLKCON_CS                 1478
#define CWG1CS                        1479
#define CWG1ISM                       1480
#define CWG1IS                        1481
#define IS                            1482
#define IS0                           1483
#define CWG1IS0                       1484
#define CWG1IS1                       1485
#define IS1                           1486
#define IS2                           1487
#define CWG1IS2                       1488
#define IS3                           1489
#define CWG1IS3                       1490
#define WDTCON0                       1491
#define WDTCON0_SEN                   1492
#define SWDTEN                        1493
#define WDTSEN                        1494
#define WDTPS                         1495
#define WDTPS0                        1496
#define WDTPS1                        1497
#define WDTPS2                        1498
#define WDTPS3                        1499
#define WDTPS4                        1500
#define WDTCON1                       1501
#define WDTWINDOW0                    1502
#define WINDOW0                       1503
#define WINDOW                        1504
#define WDTWINDOW                     1505
#define WDTWINDOW1                    1506
#define WINDOW1                       1507
#define WDTWINDOW2                    1508
#define WINDOW2                       1509
#define WDTCS                         1510
#define WDTCS0                        1511
#define WDTCS1                        1512
#define WDTCS2                        1513
#define WDTPSL                        1514
#define WDTPSL_WDTPSCNT               1515
#define WDTPSL_PSCNT                  1516
#define WDTPSCNT0                     1517
#define PSCNT0                        1518
#define WDTPSCNT1                     1519
#define PSCNT1                        1520
#define WDTPSCNT2                     1521
#define PSCNT2                        1522
#define WDTPSCNT3                     1523
#define PSCNT3                        1524
#define WDTPSCNT4                     1525
#define PSCNT4                        1526
#define WDTPSCNT5                     1527
#define PSCNT5                        1528
#define WDTPSCNT6                     1529
#define PSCNT6                        1530
#define WDTPSCNT7                     1531
#define PSCNT7                        1532
#define WDTPSH                        1533
#define PSCNT8                        1534
#define WDTPSH_WDTPSCNT               1535
#define WDTPSH_PSCNT                  1536
#define WDTPSCNT8                     1537
#define PSCNT9                        1538
#define WDTPSCNT9                     1539
#define PSCNT10                       1540
#define WDTPSCNT10                    1541
#define PSCNT11                       1542
#define WDTPSCNT11                    1543
#define PSCNT12                       1544
#define WDTPSCNT12                    1545
#define PSCNT13                       1546
#define WDTPSCNT13                    1547
#define PSCNT14                       1548
#define WDTPSCNT14                    1549
#define PSCNT15                       1550
#define WDTPSCNT15                    1551
#define PSCNT16                       1552
#define WDTPSCNT16                    1553
#define WDTPSCNT17                    1554
#define PSCNT17                       1555
#define STATE                         1556
#define WDTSTATE                      1557
#define WDTTMR                        1558
#define WDTTMR0                       1559
#define WDTTMR1                       1560
#define WDTTMR2                       1561
#define WDTTMR3                       1562
#define WDTTMR4                       1563
#define SCANLADRL                     1564
#define SCANLADRL_LADR                1565
#define LDAR0                         1566
#define SCANLADRL_SCANLADR            1567
#define SCANLADR0                     1568
#define SCANLADR1                     1569
#define LDAR1                         1570
#define LADR2                         1571
#define SCANLADR2                     1572
#define LADR3                         1573
#define SCANLADR3                     1574
#define LADR4                         1575
#define SCANLADR4                     1576
#define LADR5                         1577
#define SCANLADR5                     1578
#define SCANLADR6                     1579
#define LADR6                         1580
#define LADR7                         1581
#define SCANLADR7                     1582
#define SCANLADRH                     1583
#define LADR8                         1584
#define SCANLADRH_SCANLADR            1585
#define SCANLADR8                     1586
#define SCANLADRH_LADR                1587
#define LADR9                         1588
#define SCANLADR9                     1589
#define LADR10                        1590
#define SCANLADR10                    1591
#define SCANLADR11                    1592
#define LADR11                        1593
#define LADR12                        1594
#define SCANLADR12                    1595
#define LADR13                        1596
#define SCANLADR13                    1597
#define LADR14                        1598
#define SCANLADR14                    1599
#define LADR15                        1600
#define SCANLADR15                    1601
#define SCANHADRL                     1602
#define SCANHADR0                     1603
#define HADR0                         1604
#define SCANHADRL_HADR                1605
#define SCANHADRL_SCANHADR            1606
#define SCANHADR1                     1607
#define HADR1                         1608
#define SCANHADR2                     1609
#define HARD2                         1610
#define SCANHADR3                     1611
#define HADR3                         1612
#define SCANHADR4                     1613
#define HADR4                         1614
#define SCANHADR5                     1615
#define HADR5                         1616
#define SCANHADR6                     1617
#define HADR6                         1618
#define SCANHADR7                     1619
#define HADR7                         1620
#define SCANHADRH                     1621
#define HADR8                         1622
#define SCANHADRH_SCANHADR            1623
#define SCANHADR8                     1624
#define SCANHADRH_HADR                1625
#define HADR9                         1626
#define SCANHADR9                     1627
#define HADR10                        1628
#define SCANHADR10                    1629
#define SCANHADR11                    1630
#define HADR11                        1631
#define HADR12                        1632
#define SCANHADR12                    1633
#define HADR13                        1634
#define SCANHADR13                    1635
#define HADR14                        1636
#define SCANHADR14                    1637
#define HADR15                        1638
#define SCANHADR15                    1639
#define SCANCON0                      1640
#define SCANMODE                      1641
#define SCANMODE0                     1642
#define SCANCON0_MODE0                1643
#define SCANCON0_MODE                 1644
#define SCANCON0_MODE1                1645
#define SCANMODE1                     1646
#define INTM                          1647
#define SCANINTM                      1648
