tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1614_tdd.h
#define INVALID                       1649
#define SCANINVALID                   1650
#define SCANCON0_BUSY                 1651
#define SCANBUSY                      1652
#define SCANGO                        1653
#define SCANEN                        1654
#define SCANCON0_EN                   1655
#define SCANTRIG                      1656
#define TSEL0                         1657
#define TSEL                          1658
#define SCANTSEL0                     1659
#define SCANTSEL                      1660
#define TSEL1                         1661
#define SCANTSEL1                     1662
#define TSEL2                         1663
#define SCANTSEL2                     1664
#define TSEL3                         1665
#define SCANTSEL3                     1666
#define CRCDATL                       1667
#define CRCDATL_DAT                   1668
#define CRCDAT0                       1669
#define DAT0                          1670
#define CRCDATL_CRCDAT                1671
#define CRCDAT1                       1672
#define DAT1                          1673
#define CRCDAT2                       1674
#define DAT2                          1675
#define CRCDAT3                       1676
#define DAT3                          1677
#define CRCDAT4                       1678
#define DAT4                          1679
#define CRCDAT5                       1680
#define DAT5                          1681
#define CRCDAT6                       1682
#define DAT6                          1683
#define DAT7                          1684
#define CRDCDAT7                      1685
#define CRCDATH                       1686
#define CRCDAT8                       1687
#define DAT8                          1688
#define CRCDATH_CRCDAT                1689
#define CRCDATH_DAT                   1690
#define CRCDAT9                       1691
#define DAT9                          1692
#define DAT10                         1693
#define CRCDAT10                      1694
#define DAT11                         1695
#define CRCDAT11                      1696
#define DAT12                         1697
#define CRCDAT12                      1698
#define DAT13                         1699
#define CRCDAT13                      1700
#define DAT14                         1701
#define CRCDAT14                      1702
#define DAT15                         1703
#define CRCDAT15                      1704
#define CRCACCL                       1705
#define CRCACCL_CRCACC                1706
#define CRCACC0                       1707
#define CRCACCL_ACC0                  1708
#define CRCACCL_ACC                   1709
#define CRCACC1                       1710
#define CRCACCL_ACC1                  1711
#define CRCACC2                       1712
#define CRCACCL_ACC2                  1713
#define CRCACC3                       1714
#define CRCACCL_ACC3                  1715
#define CRCACC4                       1716
#define CRCACCL_ACC4                  1717
#define CRCACC5                       1718
#define CRCACCL_ACC5                  1719
#define CRCACC6                       1720
#define CRCACCL_ACC6                  1721
#define CRCACC7                       1722
#define CRCACCL_ACC7                  1723
#define CRCACCH                       1724
#define CRCACCH_ACC                   1725
#define CRCACCH_CRCACC                1726
#define CRCACC8                       1727
#define CRCACCH_ACC8                  1728
#define CRCACC9                       1729
#define CRCACCH_ACC9                  1730
#define CRCACCH_ACC10                 1731
#define CRCACC10                      1732
#define CRCACCH_ACC11                 1733
#define CRCACC11                      1734
#define CRCACCH_ACC12                 1735
#define CRCACC12                      1736
#define CRCACCH_ACC13                 1737
#define CRCACC13                      1738
#define CRCACCH_ACC14                 1739
#define CRCACC14                      1740
#define CRCACCH_ACC15                 1741
#define CRCACC15                      1742
#define CRCSHIFTL                     1743
#define CRCSHIFTL_CRCSHIFT            1744
#define CRCSHIFTL_SHIFT               1745
#define SHIFT0                        1746
#define CRCSHIFT0                     1747
#define SHIFT1                        1748
#define CRCSHIFT1                     1749
#define SHIFT2                        1750
#define CRCSHIFT2                     1751
#define SHIFT3                        1752
#define CRCSHIFT3                     1753
#define SHIFT4                        1754
#define CRCSHIFT4                     1755
#define SHIFT5                        1756
#define CRCSHIFT5                     1757
#define SHIFT6                        1758
#define CRCSHIFT6                     1759
#define SHIFT7                        1760
#define CRCSHIFT7                     1761
#define CRCSHIFTH                     1762
#define CRCSHIFT8                     1763
#define CRCSHIFTH_SHIFT               1764
#define CRCSHIFTH_CRCSHIFT            1765
#define SHIFT8                        1766
#define CRCSHIFT9                     1767
#define SHIFT9                        1768
#define SHIFT10                       1769
#define CRCSHIFT10                    1770
#define SHIFT11                       1771
#define CRCSHIFT11                    1772
#define SHIFT12                       1773
#define CRCSHIFT12                    1774
#define SHIFT13                       1775
#define CRCSHIFT13                    1776
#define CRCSHIFT14                    1777
#define SHIFT14                       1778
#define SHIFT15                       1779
#define CRCSHIFT15                    1780
#define CRCXORL                       1781
#define XOR1                          1782
#define CRCXOR1                       1783
#define XOR2                          1784
#define CRCXOR2                       1785
#define XOR3                          1786
#define CRCXOR3                       1787
#define XOR4                          1788
#define CRCXOR4                       1789
#define XOR5                          1790
#define CRCXOR5                       1791
#define XOR6                          1792
#define CRCXOR6                       1793
#define XOR7                          1794
#define CRCXOR7                       1795
#define CRCXORH                       1796
#define XOR8                          1797
#define CRCXOR8                       1798
#define XOR9                          1799
#define CRCXOR9                       1800
#define CRCXOR10                      1801
#define XOR10                         1802
#define CRCXOR11                      1803
#define XOR11                         1804
#define XOR12                         1805
#define CRCXOR12                      1806
#define XOR13                         1807
#define CRCXOR13                      1808
#define CRCXOR14                      1809
#define XOR14                         1810
#define CRCXOR15                      1811
#define XOR15                         1812
#define CRCCON0                       1813
#define CRCFULL                       1814
#define FULL                          1815
#define CRCSHIFTM                     1816
#define SHIFTM                        1817
#define ACCM                          1818
#define CRCACCM                       1819
#define CRCCON0_BUSY                  1820
#define CRCBUSY                       1821
#define CRCGO                         1822
#define CRCCON0_EN                    1823
#define CRCEN                         1824
#define CRCCON1                       1825
#define PLEN0                         1826
#define CRCPLEN0                      1827
#define PLEN                          1828
#define CRCPLEN                       1829
#define PLEN1                         1830
#define CRCPLEN1                      1831
#define PLEN2                         1832
#define CRCPLEN2                      1833
#define PLEN3                         1834
#define CRCPLEN3                      1835
#define DLEN                          1836
#define CRCDLEN                       1837
#define CRCDLEN0                      1838
#define DLEN0                         1839
#define DLEN1                         1840
#define CRCDLEN1                      1841
#define CRCDLEN2                      1842
#define DLEN2                         1843
#define DLEN3                         1844
#define CRCDLEN3                      1845
#define AT1RESL                       1846
#define AT1RES0                       1847
#define RES0                          1848
#define RES1                          1849
#define AT1RES1                       1850
#define AT1RES2                       1851
#define RES2                          1852
#define AT1RES3                       1853
#define RES3                          1854
#define AT1RES4                       1855
#define RES4                          1856
#define AT1RES5                       1857
#define RES5                          1858
#define RES6                          1859
#define AT1RES6                       1860
#define AT1RES7                       1861
#define RES7                          1862
#define AT1RESH                       1863
#define RES8                          1864
#define AT1RES8                       1865
#define RES9                          1866
#define AT1RES9                       1867
#define AT1MISSL                      1868
#define AT1MISS0                      1869
#define MISS0                         1870
#define AT1MISS1                      1871
#define MISS1                         1872
#define AT1MISS2                      1873
#define MISS2                         1874
#define AT1MISS3                      1875
#define MISS3                         1876
#define AT1MISS4                      1877
#define MISS4                         1878
#define AT1MISS5                      1879
#define MISS5                         1880
#define AT1MISS6                      1881
#define MISS6                         1882
#define AT1MISS7                      1883
#define MISS7                         1884
#define AT1MISSH                      1885
#define MISS8                         1886
#define AT1MISS8                      1887
#define MISS9                         1888
#define AT1MISS9                      1889
#define MISS10                        1890
#define AT1MISS10                     1891
#define MISS11                        1892
#define AT1MISS11                     1893
#define AT1MISS12                     1894
#define MISS12                        1895
#define AT1MISS13                     1896
#define MISS13                        1897
#define AT1MISS14                     1898
#define MISS14                        1899
#define AT1MISS15                     1900
#define MISS15                        1901
#define AT1PERL                       1902
#define PER0                          1903
#define AT1PER0                       1904
#define PERL0                         1905
#define PER1                          1906
#define AT1PER1                       1907
#define PERL1                         1908
#define PER2                          1909
#define AT1PER2                       1910
#define PERL2                         1911
#define PER3                          1912
#define AT1PER3                       1913
#define PERL3                         1914
#define PER4                          1915
#define AT1PER4                       1916
#define PERL4                         1917
#define PER5                          1918
#define AT1PER5                       1919
#define PERL5                         1920
#define PER6                          1921
#define AT1PER6                       1922
#define PERL6                         1923
#define PER7                          1924
#define AT1PER7                       1925
#define PERL7                         1926
#define AT1PERH                       1927
#define PER8                          1928
#define AT1PER8                       1929
#define PERH0                         1930
#define PER9                          1931
#define AT1PER9                       1932
#define PERH1                         1933
#define AT1PER10                      1934
#define PER10                         1935
#define PERH2                         1936
#define AT1PER11                      1937
#define PER11                         1938
#define PERH3                         1939
#define AT1PER12                      1940
#define PER12                         1941
#define PERH4                         1942
#define AT1PER13                      1943
#define PER13                         1944
#define PERH5                         1945
#define AT1PER14                      1946
#define PER14                         1947
#define PERH6                         1948
#define PER15                         1949
#define AT1POV                        1950
#define PERH7                         1951
#define AT1PHSL                       1952
#define PHS0                          1953
#define AT1PHS0                       1954
#define PHS1                          1955
#define AT1PHS1                       1956
#define PHS2                          1957
#define AT1PHS2                       1958
#define PHS3                          1959
#define AT1PHS3                       1960
#define PHS4                          1961
#define AT1PHS4                       1962
#define PHS5                          1963
#define AT1PHS5                       1964
#define PHS6                          1965
#define AT1PHS6                       1966
#define PHS7                          1967
#define AT1PHS7                       1968
#define AT1PHSH                       1969
#define PHSL8                         1970
#define PHS8                          1971
#define AT1PHS8                       1972
#define PHSL9                         1973
#define PHS9                          1974
#define AT1PHS9                       1975
#define AT1CON0                       1976
#define AT1CON0_MODE                  1977
#define AT1MODE                       1978
#define APMOD                         1979
#define AT1APMOD                      1980
#define AT1CON0_POL                   1981
#define AT1POL                        1982
#define AT1PS0                        1983
#define AT1CON0_PS                    1984
#define AT1PS                         1985
#define AT1CON0_PS0                   1986
#define AT1PS1                        1987
#define AT1CON0_PS1                   1988
#define PREC                          1989
#define AT1PREC                       1990
#define AT1CON0_EN                    1991
#define AT1EN                         1992
#define AT1CON1                       1993
#define AT1VALID                      1994
#define VALID                         1995
#define AT1ACCS                       1996
#define ACCS                          1997
#define MPP                           1998
#define AT1MPP                        1999
#define AT1PRP                        2000
#define PRP                           2001
#define AT1PHP                        2002
#define PHP                           2003
#define AT1IR0                        2004
#define AT1PERIF                      2005
#define AT1MISSIF                     2006
#define AT1PHSIF                      2007
#define AT1IE0                        2008
#define AT1PERIE                      2009
#define AT1MISSIE                     2010
#define AT1PHSIE                      2011
#define AT1IR1                        2012
#define AT1CC1IF                      2013
#define AT1CC2IF                      2014
#define AT1CC3IF                      2015
#define AT1IE1                        2016
#define AT1CC1IE                      2017
#define AT1CC2IE                      2018
#define AT1CC3IE                      2019
#define AT1STPTL                      2020
#define STPT0                         2021
#define AT1STPT0                      2022
#define STPT1                         2023
#define AT1STPT1                      2024
#define STPT2                         2025
#define AT1STPT2                      2026
#define STPT3                         2027
#define AT1STPT3                      2028
#define STPT4                         2029
#define AT1STPT4                      2030
#define STPT5                         2031
#define AT1STPT5                      2032
#define STPT6                         2033
#define AT1STPT6                      2034
#define STPT7                         2035
#define AT1STPT7                      2036
#define AT1STPTH                      2037
#define STPT8                         2038
#define AT1STPT8                      2039
#define STPT9                         2040
#define AT1STPT9                      2041
#define AT1STPT10                     2042
#define STPT10                        2043
#define AT1STPT11                     2044
#define STPT11                        2045
#define AT1STPT12                     2046
#define STPT12                        2047
#define AT1STPT13                     2048
#define STPT13                        2049
#define AT1STPT14                     2050
#define STPT14                        2051
#define AT1ERRL                       2052
#define AT1ERR0                       2053
#define ERR0                          2054
#define ERRL0                         2055
#define AT1ERR1                       2056
#define ERR1                          2057
#define ERRL1                         2058
#define AT1ERR2                       2059
#define ERR2                          2060
#define ERRL2                         2061
#define AT1ERR3                       2062
#define ERR3                          2063
#define ERRL3                         2064
#define AT1ERR4                       2065
#define ERRL4                         2066
#define ERR4                          2067
#define AT1ERR5                       2068
#define ERRL5                         2069
#define ERR5                          2070
#define AT1ERR6                       2071
#define ERRL6                         2072
#define ERR6                          2073
#define AT1ERR7                       2074
#define ERRL7                         2075
#define ERR7                          2076
#define AT1ERRH                       2077
#define AT1ERR8                       2078
#define ERRH0                         2079
#define ERR8                          2080
#define AT1ERR9                       2081
#define ERRH1                         2082
#define ERR9                          2083
#define AT1ERR10                      2084
#define ERR10                         2085
#define ERRH2                         2086
#define AT1ERR11                      2087
#define ERR11                         2088
#define ERRH3                         2089
#define AT1ERR12                      2090
#define ERR12                         2091
#define ERRH4                         2092
#define AT1ERR13                      2093
#define ERR13                         2094
#define ERRH5                         2095
#define AT1ERR14                      2096
#define ERR14                         2097
#define ERRH6                         2098
#define AT1ERR15                      2099
#define ERR15                         2100
#define ERRH7                         2101
#define AT1CLK                        2102
#define AT1CLK_CS                     2103
#define AT1CS                         2104
#define AT1CLK_CS0                    2105
#define AT1CS0                        2106
#define AT1SIG                        2107
#define AT1SSEL0                      2108
#define AT1SIG_SSEL0                  2109
#define AT1SIG_SSEL                   2110
#define AT1SSEL                       2111
#define AT1SSEL1                      2112
#define AT1SIG_SSEL1                  2113
#define AT1SSEL2                      2114
#define AT1SIG_SSEL2                  2115
#define AT1CSEL1                      2116
#define CP1S0                         2117
#define AT1CP1S0                      2118
#define AT1CP1S                       2119
#define CP1S                          2120
#define CP1S1                         2121
#define AT1CP1S1                      2122
#define CP1S2                         2123
#define AT1CP1S2                      2124
#define AT1CC1L                       2125
#define AT1CC10                       2126
#define CC10                          2127
#define AT1CC11                       2128
#define CC11                          2129
#define AT1CC12                       2130
#define CC12                          2131
#define AT1CC1L_CC13                  2132
#define AT1CC13                       2133
#define AT1CC14                       2134
#define CC14                          2135
#define AT1CC15                       2136
#define CC15                          2137
#define AT1CC16                       2138
#define CC16                          2139
#define AT1CC17                       2140
#define CC17                          2141
#define AT1CC1H                       2142
#define CC18                          2143
#define AT1CC18                       2144
#define CC19                          2145
#define AT1CC19                       2146
#define AT1CCON1                      2147
#define AT1CC1MODE                    2148
#define CC1MODE                       2149
#define CAP1P                         2150
#define AT1CAP1P                      2151
#define CC1POL                        2152
#define AT1CC1POL                     2153
#define AT1CC1EN                      2154
#define CC1EN                         2155
#define AT1CSEL2                      2156
#define AT1CP2S0                      2157
#define AT1CP2S                       2158
#define CP2S0                         2159
#define CP2S                          2160
#define CP2S1                         2161
#define AT1CP2S1                      2162
#define AT1CP2S2                      2163
#define CP2S2                         2164
#define AT1CC2L                       2165
#define AT1CC20                       2166
#define CC20                          2167
#define AT1CC21                       2168
#define CC21                          2169
#define AT1CC22                       2170
#define CC22                          2171
#define AT1CC23                       2172
#define AT1CC2L_CC13                  2173
#define AT1CC24                       2174
#define CC24                          2175
#define AT1CC25                       2176
#define CCW5                          2177
#define AT1CC26                       2178
#define CC26                          2179
#define AT1CC27                       2180
#define CC27                          2181
#define AT1CC2H                       2182
#define CC28                          2183
#define AT1CC28                       2184
#define CC29                          2185
#define AT1CC29                       2186
#define AT1CCON2                      2187
#define CC2MODE                       2188
#define AT1CC2MODE                    2189
#define AT1CAP2P                      2190
#define CAP2P                         2191
#define AT1CC2POL                     2192
#define CC2POL                        2193
#define CC2EN                         2194
#define AT1CC2EN                      2195
#define AT1CSEL3                      2196
#define CP3S0                         2197
#define AT1CP3S                       2198
#define AT1CP3S0                      2199
#define CP3S                          2200
#define CP3S1                         2201
#define AT1CP3S1                      2202
#define CP3S2                         2203
#define AT1CP3S2                      2204
#define AT1CC3L                       2205
#define AT1CC30                       2206
