tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1614_tdd.h
#define CC30                          2207
#define AT1CC31                       2208
#define CC31                          2209
#define AT1CC32                       2210
#define CC32                          2211
#define AT1CC33                       2212
#define CC33                          2213
#define AT1CC34                       2214
#define CC34                          2215
#define AT1CC35                       2216
#define CC35                          2217
#define AT1CC36                       2218
#define CC36                          2219
#define AT1CC37                       2220
#define CC37                          2221
#define AT1CC3H                       2222
#define CC38                          2223
#define AT1CC38                       2224
#define CC39                          2225
#define AT1CC39                       2226
#define AT1CCON3                      2227
#define AT1CC3MODE                    2228
#define CC3MODE                       2229
#define AT1CAP3P                      2230
#define CAP3P                         2231
#define AT1CC3POL                     2232
#define CC3POL                        2233
#define CC3EN                         2234
#define AT1CC3EN                      2235
#define SMT1TMRL                      2236
#define SMT1TMR0                      2237
#define SMT1TMRL_SMT1TMR              2238
#define SMT1TMR1                      2239
#define SMT1TMR2                      2240
#define SMT1TMR3                      2241
#define SMT1TMR4                      2242
#define SMT1TMR5                      2243
#define SMT1TMR6                      2244
#define SMT1TMR7                      2245
#define SMT1TMRH                      2246
#define SMT1TMR8                      2247
#define SMT1TMRH_SMT1TMR              2248
#define SMT1TMR9                      2249
#define SMT1TMR10                     2250
#define SMT1TMR11                     2251
#define SMT1TMR12                     2252
#define SMT1TMR13                     2253
#define SMT1TMR14                     2254
#define SMT1TMR15                     2255
#define SMT1TMRU                      2256
#define SMT1TMR16                     2257
#define SMT1TMRU_SMT1TMR              2258
#define SMT1TMR17                     2259
#define SMT1TMR18                     2260
#define SMT1TMR19                     2261
#define SMT1TMR20                     2262
#define SMT1TMR21                     2263
#define SMT1TMR22                     2264
#define SMT1TMR23                     2265
#define SMT1CPRL                      2266
#define SMT1CPRL_SMT1CPR              2267
#define SMT1CPR0                      2268
#define SMT1CPR1                      2269
#define SMT1CPR2                      2270
#define SMT1CPR3                      2271
#define SMT1CPR4                      2272
#define SMT1CPR5                      2273
#define SMT1CPR6                      2274
#define SMT1CPR7                      2275
#define SMT1CPRH                      2276
#define SMT1CPRH_SMT1CPR              2277
#define SMT1CPR8                      2278
#define SMT1CPR9                      2279
#define SMT1CPR10                     2280
#define SMT1CPR11                     2281
#define SMT1CPR12                     2282
#define SMT1CPR13                     2283
#define SMT1CPR14                     2284
#define SMT1CPR15                     2285
#define SMT1CPRU                      2286
#define SMT1CPR16                     2287
#define SMT1CPRU_SMT1CPR              2288
#define SMT1CPR17                     2289
#define SMT1CPR18                     2290
#define SMT1CPR19                     2291
#define SMT1CPR20                     2292
#define SMT1CPR21                     2293
#define SMT1CPR22                     2294
#define SMT1CPR23                     2295
#define SMT1CPWL                      2296
#define SMT1CPW0                      2297
#define SMT1CPWL_SMT1CPW              2298
#define SMT1CPW1                      2299
#define SMT1CPW2                      2300
#define SMT1CPW3                      2301
#define SMT1CPW4                      2302
#define SMT1CPW5                      2303
#define SMT1CPW6                      2304
#define SMT1CPW7                      2305
#define SMT1CPWH                      2306
#define SMT1CPW8                      2307
#define SMT1CPWH_SMT1CPW              2308
#define SMT1CPW9                      2309
#define SMT1CPW10                     2310
#define SMT1CPW11                     2311
#define SMT1CPW12                     2312
#define SMT1CPW13                     2313
#define SMT1CPW14                     2314
#define SMT1CPW15                     2315
#define SMT1CPWU                      2316
#define SMT1CPWU_SMT1CPW              2317
#define SMT1CPW16                     2318
#define SMT1CPW17                     2319
#define SMT1CPW18                     2320
#define SMT1CPW19                     2321
#define SMT1CPW20                     2322
#define SMT1CPW21                     2323
#define SMT1CPW22                     2324
#define SMT1CPW23                     2325
#define SMT1PRL                       2326
#define SMT1PR0                       2327
#define SMT1PRL_SMT1PR                2328
#define SMT1PR1                       2329
#define SMT1PR2                       2330
#define SMT1PR3                       2331
#define SMT1PR4                       2332
#define SMT1PR5                       2333
#define SMT1PR6                       2334
#define SMT1PR7                       2335
#define SMT1PRH                       2336
#define SMT1PR8                       2337
#define SMT1PRH_SMT1PR                2338
#define SMT1PR9                       2339
#define SMT1PR10                      2340
#define SMT1PR11                      2341
#define SMT1PR12                      2342
#define SMT1PR13                      2343
#define SMT1PR14                      2344
#define SMT1PR15                      2345
#define SMT1PRU                       2346
#define SMT1PR16                      2347
#define SMT1PRU_SMT1PR                2348
#define SMT1PR17                      2349
#define SMT1PR18                      2350
#define SMT1PR19                      2351
#define SMT1PR20                      2352
#define SMT1PR21                      2353
#define SMT1PR22                      2354
#define SMT1PR23                      2355
#define SMT1CON0                      2356
#define SMT1PS0                       2357
#define SMT1PS                        2358
#define SMT1PS1                       2359
#define SMT1CON0_CPOL                 2360
#define SMT1CON0_SPOL                 2361
#define SMT1CON0_WPOL                 2362
#define SMT1CON0_STP                  2363
#define SMT1CON0_EN                   2364
#define SMT1CON1                      2365
#define SMT1MODE0                     2366
#define SMT1CON1_MODE                 2367
#define SMT1CON1_MODE0                2368
#define SMT1MODE                      2369
#define SMT1CON1_MODE1                2370
#define SMT1MODE1                     2371
#define SMT1CON1_MODE2                2372
#define SMT1MODE2                     2373
#define SMT1CON1_MODE3                2374
#define SMT1MODE3                     2375
#define SMT1CON1_REPEAT               2376
#define SMT1REPEAT                    2377
#define SMT1GO                        2378
#define SMT1STAT                      2379
#define SMT1STAT_AS                   2380
#define SMT1AS                        2381
#define SMT1STAT_WS                   2382
#define SMT1WS                        2383
#define SMT1STAT_TS                   2384
#define SMT1TS                        2385
#define SMT1RESET                     2386
#define SMT1STAT_RST                  2387
#define SMT1CPWUP                     2388
#define SMT1STAT_CPWUP                2389
#define SMT1CPRUP                     2390
#define SMT1STAT_CPRUP                2391
#define SMT1CLK                       2392
#define SMT1CLK_CSEL0                 2393
#define SMT1CSEL0                     2394
#define SMT1CSEL                      2395
#define SMT1CLK_CSEL                  2396
#define SMT1CSEL1                     2397
#define SMT1CLK_CSEL1                 2398
#define SMT1CSEL2                     2399
#define SMT1CLK_CSEL2                 2400
#define SMT1SIG                       2401
#define SMT1SSEL                      2402
#define SMT1SIG_SSEL0                 2403
#define SMT1SIG_SSEL                  2404
#define SMT1SSEL0                     2405
#define SMT1SIG_SSEL1                 2406
#define SMT1SSEL1                     2407
#define SMT1SIG_SSEL2                 2408
#define SMT1SSEL2                     2409
#define SMT1SIG_SSEL3                 2410
#define SMT1SSEL3                     2411
#define SMT1SIG_SSEL4                 2412
#define SMT1SSEL4                     2413
#define SMT1WIN                       2414
#define SMT1WSEL                      2415
#define SMT1WSEL0                     2416
#define SMT1WIN_WSEL0                 2417
#define SMT1WIN_WSEL                  2418
#define SMT1WSEL1                     2419
#define SMT1WIN_WSEL1                 2420
#define SMT1WIN_WSEL2                 2421
#define SMT1WSEL2                     2422
#define SMT1WIN_WSEL3                 2423
#define SMT1WSEL3                     2424
#define SMT1WIN_WSEL4                 2425
#define SMT1WSEL4                     2426
#define SMT2TMRL                      2427
#define SMT2TMRL_SMT2TMR              2428
#define SMT2TMR0                      2429
#define SMT2TMR1                      2430
#define SMT2TMR2                      2431
#define SMT2TMR3                      2432
#define SMT2TMR4                      2433
#define SMT2TMR5                      2434
#define SMT2TMR6                      2435
#define SMT2TMR7                      2436
#define SMT2TMRH                      2437
#define SMT2TMR8                      2438
#define SMT2TMRH_SMT2TMR              2439
#define SMT2TMR9                      2440
#define SMT2TMR10                     2441
#define SMT2TMR11                     2442
#define SMT2TMR12                     2443
#define SMT2TMR13                     2444
#define SMT2TMR14                     2445
#define SMT2TMR15                     2446
#define SMT2TMRU                      2447
#define SMT2TMR16                     2448
#define SMT2TMRU_SMT2TMR              2449
#define SMT2TMR17                     2450
#define SMT2TMR18                     2451
#define SMT2TMR19                     2452
#define SMT2TMR20                     2453
#define SMT2TMR21                     2454
#define SMT2TMR22                     2455
#define SMT2TMR23                     2456
#define SMT2CPRL                      2457
#define SMT2CPRL_SMT2CPR              2458
#define SMT2CPR0                      2459
#define SMT2CPR1                      2460
#define SMT2CPR2                      2461
#define SMT2CPR3                      2462
#define SMT2CPR4                      2463
#define SMT2CPR5                      2464
#define SMT2CPR6                      2465
#define SMT2CPR7                      2466
#define SMT2CPRH                      2467
#define SMT2CPR8                      2468
#define SMT2CPRH_SMT2CPR              2469
#define SMT2CPR9                      2470
#define SMT2CPR10                     2471
#define SMT2CPR11                     2472
#define SMT2CPR12                     2473
#define SMT2CPR13                     2474
#define SMT2CPR14                     2475
#define SMT2CPR15                     2476
#define SMT2CPRU                      2477
#define SMT2CPRU_SMT2CPR              2478
#define SMT2CPR16                     2479
#define SMT2CPR17                     2480
#define SMT2CPR18                     2481
#define SMT2CPR19                     2482
#define SMT2CPR20                     2483
#define SMT2CPR21                     2484
#define SMT2CPR22                     2485
#define SMT2CPR23                     2486
#define SMT2CPWL                      2487
#define SMT2CPWL_SMT2CPW              2488
#define SMT2CPW0                      2489
#define SMT2CPW1                      2490
#define SMT2CPW2                      2491
#define SMT2CPW3                      2492
#define SMT2CPW4                      2493
#define SMT2CPW5                      2494
#define SMT2CPW6                      2495
#define SMT2CPW7                      2496
#define SMT2CPWH                      2497
#define SMT2CPWH_SMT2CPW              2498
#define SMT2CPW8                      2499
#define SMT2CPW9                      2500
#define SMT2CPW10                     2501
#define SMT2CPW11                     2502
#define SMT2CPW12                     2503
#define SMT2CPW13                     2504
#define SMT2CPW14                     2505
#define SMT2CPW15                     2506
#define SMT2CPWU                      2507
#define SMT2CPWU_SMT2CPW              2508
#define SMT2CPW16                     2509
#define SMT2CPW17                     2510
#define SMT2CPW18                     2511
#define SMT2CPW19                     2512
#define SMT2CPW20                     2513
#define SMT2CPW21                     2514
#define SMT2CPW22                     2515
#define SMT2CPW23                     2516
#define SMT2PRL                       2517
#define SMT2PRL_SMT2PR                2518
#define SMT2PR0                       2519
#define SMT2PR1                       2520
#define SMT2PR2                       2521
#define SMT2PR3                       2522
#define SMT2PR4                       2523
#define SMT2PR5                       2524
#define SMT2PR6                       2525
#define SMT2PR7                       2526
#define SMT2PRH                       2527
#define SMT2PRH_SMT2PR                2528
#define SMT2PR8                       2529
#define SMT2PR9                       2530
#define SMT2PR10                      2531
#define SMT2PR11                      2532
#define SMT2PR12                      2533
#define SMT2PR13                      2534
#define SMT2PR14                      2535
#define SMT2PR15                      2536
#define SMT2PRU                       2537
#define SMT2PRU_SMT2PR                2538
#define SMT2PR16                      2539
#define SMT2PR17                      2540
#define SMT2PR18                      2541
#define SMT2PR19                      2542
#define SMT2PR20                      2543
#define SMT2PR21                      2544
#define SMT2PR22                      2545
#define SMT2PR23                      2546
#define SMT2CON0                      2547
#define SMT2PS0                       2548
#define SMT2PS                        2549
#define SMT2PS1                       2550
#define SMT2CON0_CPOL                 2551
#define SMT2CON0_SPOL                 2552
#define SMT2CON0_WPOL                 2553
#define SMT2CON0_STP                  2554
#define SMT2CON0_EN                   2555
#define SMT2CON1                      2556
#define SMT2CON1_MODE                 2557
#define SMT2CON1_MODE0                2558
#define SMT2MODE0                     2559
#define SMT2MODE                      2560
#define SMT2CON1_MODE1                2561
#define SMT2MODE1                     2562
#define SMT2CON1_MODE2                2563
#define SMT2MODE2                     2564
#define SMT2CON1_MODE3                2565
#define SMT2MODE3                     2566
#define SMT2REPEAT                    2567
#define SMT2CON1_REPEAT               2568
#define SMT2GO                        2569
#define SMT2STAT                      2570
#define SMT2AS                        2571
#define SMT2STAT_AS                   2572
#define SMT2WS                        2573
#define SMT2STAT_WS                   2574
#define SMT2STAT_TS                   2575
#define SMT2TS                        2576
#define SMT2RESET                     2577
#define SMT2STAT_RST                  2578
#define SMT2CPWUP                     2579
#define SMT2STAT_CPWUP                2580
#define SMT2STAT_CPRUP                2581
#define SMT2CPRUP                     2582
#define SMT2CLK                       2583
#define SMT2CLK_CSEL                  2584
#define SMT2CLK_CSEL0                 2585
#define SMT2CSEL0                     2586
#define SMT2CSEL                      2587
#define SMT2CLK_CSEL1                 2588
#define SMT2CSEL1                     2589
#define SMT2CLK_CSEL2                 2590
#define SMT2CSEL2                     2591
#define SMT2SIG                       2592
#define SMT2SIG_SSEL                  2593
#define SMT2SSEL0                     2594
#define SMT2SSEL                      2595
#define SMT2SIG_SSEL0                 2596
#define SMT2SSEL1                     2597
#define SMT2SIG_SSEL1                 2598
#define SMT2SSEL2                     2599
#define SMT2SIG_SSEL2                 2600
#define SMT2SIG_SSEL3                 2601
#define SMT2SSEL3                     2602
#define SMT2SSEL4                     2603
#define SMT2SIG_SSEL4                 2604
#define SMT2WIN                       2605
#define SMT2WIN_WSEL0                 2606
#define SMT2WSEL0                     2607
#define SMT2WSEL                      2608
#define SMT2WIN_WSEL                  2609
#define SMT2WSEL1                     2610
#define SMT2WIN_WSEL1                 2611
#define SMT2WSEL2                     2612
#define SMT2WIN_WSEL2                 2613
#define SMT2WSEL3                     2614
#define SMT2WIN_WSEL3                 2615
#define SMT2WSEL4                     2616
#define SMT2WIN_WSEL4                 2617
#define PPSLOCK                       2618
#define PPSLOCKED                     2619
#define INTPPS                        2620
#define INTPPS0                       2621
#define INTPPS1                       2622
#define INTPPS2                       2623
#define INTPPS3                       2624
#define INTPPS4                       2625
#define T0CKIPPS                      2626
#define T0CKIPPS0                     2627
#define T0CKIPPS1                     2628
#define T0CKIPPS2                     2629
#define T0CKIPPS3                     2630
#define T0CKIPPS4                     2631
#define T1CKIPPS                      2632
#define T1CKIPPS0                     2633
#define T1CKIPPS1                     2634
#define T1CKIPPS2                     2635
#define T1CKIPPS3                     2636
#define T1CKIPPS4                     2637
#define T1GPPS                        2638
#define T1GPPS0                       2639
#define T1GPPS1                       2640
#define T1GPPS2                       2641
#define T1GPPS3                       2642
#define T1GPPS4                       2643
#define CCP1PPS                       2644
#define CCP1PPS0                      2645
#define CCP1PPS1                      2646
#define CCP1PPS2                      2647
#define CCP1PPS3                      2648
#define CCP1PPS4                      2649
#define CCP2PPS                       2650
#define CCP2PPS0                      2651
#define CCP2PPS1                      2652
#define CCP2PPS2                      2653
#define CCP2PPS3                      2654
#define CCP2PPS4                      2655
#define ATINPPS                       2656
#define ATINPPS0                      2657
#define ATINPPS1                      2658
#define ATINPPS2                      2659
#define ATINPPS3                      2660
#define ATINPPS4                      2661
#define CWGINPPS                      2662
#define CWGINPPS0                     2663
#define CWGINPPS1                     2664
#define CWGINPPS2                     2665
#define CWGINPPS3                     2666
#define CWGINPPS4                     2667
#define T2PPS                         2668
#define T2PPS0                        2669
#define T2PPS1                        2670
#define T2PPS2                        2671
#define T2PPS3                        2672
#define T2PPS4                        2673
#define T3CKIPPS                      2674
#define T3CKIPPS0                     2675
#define T3CKIPPS1                     2676
#define T3CKIPPS2                     2677
#define T3CKIPPS3                     2678
#define T3CKIPPS4                     2679
#define T3GPPS                        2680
#define T3GPPS0                       2681
#define T3GPPS1                       2682
#define T3GPPS2                       2683
#define T3GPPS3                       2684
#define T3GPPS4                       2685
#define T4PPS                         2686
#define T4PPS0                        2687
#define T4PPS1                        2688
#define T4PPS2                        2689
#define T4PPS3                        2690
#define T4PPS4                        2691
#define T5CKIPPS                      2692
#define T5CKIPPS0                     2693
#define T5CKIPPS1                     2694
#define T5CKIPPS2                     2695
#define T5CKIPPS3                     2696
#define T5CKIPPS4                     2697
#define T5GPPS                        2698
#define T5GPPS0                       2699
#define T5GPPS1                       2700
#define T5GPPS2                       2701
#define T5GPPS3                       2702
#define T5GPPS4                       2703
#define T6PPS                         2704
#define T6PPS0                        2705
#define T6PPS1                        2706
#define T6PPS2                        2707
#define T6PPS3                        2708
#define T6PPS4                        2709
#define ATCC1PPS                      2710
#define ATCC1PPS0                     2711
#define ATCC1PPS1                     2712
#define ATCC1PPS2                     2713
#define ATCC1PPS3                     2714
#define ATCC1PPS4                     2715
#define SSPCLKPPS                     2716
#define SSPCLKPPS0                    2717
#define SSPCLKPPS1                    2718
#define SSPCLKPPS2                    2719
#define SSPCLKPPS3                    2720
#define SSPCLKPPS4                    2721
#define SSPDATPPS                     2722
#define SSPDATPPS0                    2723
#define SSPDATPPS1                    2724
#define SSPDATPPS2                    2725
#define SSPDATPPS3                    2726
#define SSPDATPPS4                    2727
#define SSPSSPPS                      2728
#define SSPSSPPS0                     2729
#define SSPSSPPS1                     2730
#define SSPSSPPS2                     2731
#define SSPSSPPS3                     2732
#define SSPSSPPS4                     2733
#define ATCC2PPS                      2734
#define ATCC2PPS0                     2735
#define ATCC2PPS1                     2736
#define ATCC2PPS2                     2737
#define ATCC2PPS3                     2738
#define ATCC2PPS4                     2739
#define RXPPS                         2740
#define RXPPS0                        2741
#define RXPPS1                        2742
#define RXPPS2                        2743
#define RXPPS3                        2744
#define RXPPS4                        2745
#define CKPPS                         2746
#define CKPPS0                        2747
#define CKPPS1                        2748
#define CKPPS2                        2749
#define CKPPS3                        2750
#define CKPPS4                        2751
#define SMT1SIGPPS                    2752
#define SMT1SIGPPS0                   2753
#define SMT1SIGPPS1                   2754
#define SMT1SIGPPS2                   2755
#define SMT1SIGPPS3                   2756
#define SMT1SIGPPS4                   2757
#define SMT1WINPPS                    2758
#define SMTWINPPS0                    2759
#define SMTWINPPS1                    2760
#define SMTWINPPS2                    2761
#define SMTWINPPS3                    2762
#define SMTWINPPS4                    2763
#define CLCIN0PPS                     2764
