tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1614_tdd.h
#define CLCIN0PPS0                    2765
#define CLCIN0PPS1                    2766
#define CLCIN0PPS2                    2767
#define CLCIN0PPS3                    2768
#define CLCIN0PPS4                    2769
#define CLCIN1PPS                     2770
#define CLCIN1PPS0                    2771
#define CLCIN1PPS1                    2772
#define CLCIN1PPS2                    2773
#define CLCIN1PPS3                    2774
#define CLCIN1PPS4                    2775
#define CLCIN2PPS                     2776
#define CLCIN2PPS0                    2777
#define CLCIN2PPS1                    2778
#define CLCIN2PPS2                    2779
#define CLCIN2PPS3                    2780
#define CLCIN2PPS4                    2781
#define CLCIN3PPS                     2782
#define CLCIN3PPS0                    2783
#define CLCIN3PPS1                    2784
#define CLCIN3PPS2                    2785
#define CLCIN3PPS3                    2786
#define CLCIN3PPS4                    2787
#define SMT2SIGPPS                    2788
#define SMT2SIGPPS0                   2789
#define SMT2SIGPPS1                   2790
#define SMT2SIGPPS2                   2791
#define SMT2SIGPPS3                   2792
#define SMT2SIGPPS4                   2793
#define SMT2WINPPS                    2794
#define SMT2WINPPS0                   2795
#define SMT2WINPPS1                   2796
#define SMT2WINPPS2                   2797
#define SMT2WINPPS3                   2798
#define SMT2WINPPS4                   2799
#define ATCC3PPS                      2800
#define ATCC3PPS0                     2801
#define ATCC3PPS1                     2802
#define ATCC3PPS2                     2803
#define ATCC3PPS3                     2804
#define ATCC3PPS4                     2805
#define RA0PPS                        2806
#define RA0PPS0                       2807
#define RA0PPS1                       2808
#define RA0PPS2                       2809
#define RA0PPS3                       2810
#define RA0PPS4                       2811
#define RA1PPS                        2812
#define RA1PPS0                       2813
#define RA1PPS1                       2814
#define RA1PPS2                       2815
#define RA1PPS3                       2816
#define RA1PPS4                       2817
#define RA2PPS                        2818
#define RA2PPS0                       2819
#define RA2PPS1                       2820
#define RA2PPS2                       2821
#define RA2PPS3                       2822
#define RA2PPS4                       2823
#define RA4PPS                        2824
#define RA4PPS0                       2825
#define RA4PPS1                       2826
#define RA4PPS2                       2827
#define RA4PPS3                       2828
#define RA4PPS4                       2829
#define RA5PPS                        2830
#define RA5PPS0                       2831
#define RA5PPS1                       2832
#define RA5PPS2                       2833
#define RA5PPS3                       2834
#define RA5PPS4                       2835
#define RC0PPS                        2836
#define RC0PPS0                       2837
#define RC0PPS1                       2838
#define RC0PPS2                       2839
#define RC0PPS3                       2840
#define RC0PPS4                       2841
#define RC1PPS                        2842
#define RC1PPS0                       2843
#define RC1PPS1                       2844
#define RC1PPS2                       2845
#define RC1PPS3                       2846
#define RC1PPS4                       2847
#define RC2PPS                        2848
#define RC2PPS0                       2849
#define RC2PPS1                       2850
#define RC2PPS2                       2851
#define RC2PPS3                       2852
#define RC2PPS4                       2853
#define RC3PPS                        2854
#define RC3PPS0                       2855
#define RC3PPS1                       2856
#define RC3PPS2                       2857
#define RC3PPS3                       2858
#define RC3PPS4                       2859
#define RC4PPS                        2860
#define RC4PPS0                       2861
#define RC4PPS1                       2862
#define RC4PPS2                       2863
#define RC4PPS3                       2864
#define RC4PPS4                       2865
#define RC5PPS                        2866
#define RC5PPS0                       2867
#define RC5PPS1                       2868
#define RC5PPS2                       2869
#define RC5PPS3                       2870
#define RC5PPS4                       2871
#define CLCDATA                       2872
#define MLC1OUT                       2873
#define MLC2OUT                       2874
#define CLC1CON                       2875
#define CLC1CON_MODE                  2876
#define LC1MODE0                      2877
#define LC1MODE                       2878
#define CLC1CON_MODE0                 2879
#define LC1MODE1                      2880
#define CLC1CON_MODE1                 2881
#define LC1MODE2                      2882
#define CLC1CON_MODE2                 2883
#define LC1INTN                       2884
#define CLC1CON_INTN                  2885
#define LC1INTP                       2886
#define CLC1CON_INTP                  2887
#define LC1OUT                        2888
#define CLC1CON_OUT                   2889
#define LC1EN                         2890
#define CLC1CON_EN                    2891
#define CLC1POL                       2892
#define LC1G1POL                      2893
#define CLC1POL_G1POL                 2894
#define CLC1POL_G2POL                 2895
#define LC1G2POL                      2896
#define LC1G3POL                      2897
#define CLC1POL_G3POL                 2898
#define LC1G4POL                      2899
#define CLC1POL_G4POL                 2900
#define CLC1POL_POL                   2901
#define LC1POL                        2902
#define CLC1SEL0                      2903
#define CLC1SEL0_D1S0                 2904
#define LC1D1S0                       2905
#define CLC1SEL0_D1S                  2906
#define LC1D1S                        2907
#define CLC1SEL0_D1S1                 2908
#define LC1D1S1                       2909
#define CLC1SEL0_D1S2                 2910
#define LC1D1S2                       2911
#define LC1D1S3                       2912
#define CLC1SEL0_D1S3                 2913
#define CLC1SEL0_D1S4                 2914
#define LC1D1S4                       2915
#define CLC1SEL0_D1S5                 2916
#define LC1D1S5                       2917
#define CLC1SEL1                      2918
#define CLC1SEL1_D2S0                 2919
#define CLC1SEL1_D2S                  2920
#define LC1D2S                        2921
#define LC1D2S0                       2922
#define CLC1SEL1_D2S1                 2923
#define LC1D2S1                       2924
#define CLC1SEL1_D2S2                 2925
#define LC1D2S2                       2926
#define LC1D2S3                       2927
#define CLC1SEL1_D2S3                 2928
#define LC1D2S4                       2929
#define CLC1SEL1_D2S4                 2930
#define LC1D2S5                       2931
#define CLC1SEL1_D2S5                 2932
#define CLC1SEL2                      2933
#define LC1D3S0                       2934
#define CLC1SEL2_D3S                  2935
#define LC1D3S                        2936
#define CLC1SEL2_D3S0                 2937
#define LC1D3S1                       2938
#define CLC1SEL2_D3S1                 2939
#define LC1D3S2                       2940
#define CLC1SEL2_D3S2                 2941
#define LC1D3S3                       2942
#define CLC1SEL2_D3S3                 2943
#define LC1D3S4                       2944
#define CLC1SEL2_D3S4                 2945
#define LC1D3S5                       2946
#define CLC1SEL2_D3S5                 2947
#define CLC1SEL3                      2948
#define CLC1SEL3_D4S                  2949
#define LC1D4S                        2950
#define LC1D4S0                       2951
#define CLC1SEL3_D4S0                 2952
#define CLC1SEL3_D4S1                 2953
#define LC1D4S1                       2954
#define LC1D4S2                       2955
#define CLC1SEL3_D4S2                 2956
#define LC1D4S3                       2957
#define CLC1SEL3_D4S3                 2958
#define LC1D4S4                       2959
#define CLC1SEL3_D4S4                 2960
#define LC1D4S5                       2961
#define CLC1SEL3_D4S5                 2962
#define CLC1GLS0                      2963
#define CLC1GLS0_D1N                  2964
#define LC1G1D1N                      2965
#define CLC1GLS0_D1T                  2966
#define LC1G1D1T                      2967
#define LC1G1D2N                      2968
#define CLC1GLS0_D2N                  2969
#define LC1G1D2T                      2970
#define CLC1GLS0_D2T                  2971
#define CLC1GLS0_D3N                  2972
#define LC1G1D3N                      2973
#define CLC1GLS0_D3T                  2974
#define LC1G1D3T                      2975
#define CLC1GLS0_D4N                  2976
#define LC1G1D4N                      2977
#define CLC1GLS0_D4T                  2978
#define LC1G1D4T                      2979
#define CLC1GLS1                      2980
#define CLC1GLS1_D1N                  2981
#define LC1G2D1N                      2982
#define LC1G2D1T                      2983
#define CLC1GLS1_D1T                  2984
#define CLC1GLS1_D2N                  2985
#define LC1G2D2N                      2986
#define LC1G2D2T                      2987
#define CLC1GLS1_D2T                  2988
#define CLC1GLS1_D3N                  2989
#define LC1G2D3N                      2990
#define LC1G2D3T                      2991
#define CLC1GLS1_D3T                  2992
#define CLC1GLS1_D4N                  2993
#define LC1G2D4N                      2994
#define LC1G2D4T                      2995
#define CLC1GLS1_D4T                  2996
#define CLC1GLS2                      2997
#define CLC1GLS2_D1N                  2998
#define LC1G3D1N                      2999
#define LC1G3D1T                      3000
#define CLC1GLS2_D1T                  3001
#define LC1G3D2N                      3002
#define CLC1GLS2_D2N                  3003
#define LC1G3D2T                      3004
#define CLC1GLS2_D2T                  3005
#define CLC1GLS2_D3N                  3006
#define LC1G3D3N                      3007
#define LC1G3D3T                      3008
#define CLC1GLS2_D3T                  3009
#define LC1G3D4N                      3010
#define CLC1GLS2_D4N                  3011
#define LC1G3D4T                      3012
#define CLC1GLS2_D4T                  3013
#define CLC1GLS3                      3014
#define LC1G4D1N                      3015
#define CLC1GLS3_G4D1N                3016
#define LC1G4D1T                      3017
#define CLC1GLS3_G4D1T                3018
#define CLC1GLS3_G4D2N                3019
#define LC1G4D2N                      3020
#define CLC1GLS3_G4D2T                3021
#define LC1G4D2T                      3022
#define LC1G4D3N                      3023
#define CLC1GLS3_G4D3N                3024
#define LC1G4D3T                      3025
#define CLC1GLS3_G4D3T                3026
#define CLC1GLS3_G4D4N                3027
#define LC1G4D4N                      3028
#define CLC1GLS3_G4D4T                3029
#define LC1G4D4T                      3030
#define CLC2CON                       3031
#define LC2MODE0                      3032
#define CLC2CON_MODE                  3033
#define LC2MODE                       3034
#define CLC2CON_MODE0                 3035
#define LC2MODE1                      3036
#define CLC2CON_MODE1                 3037
#define LC2MODE2                      3038
#define CLC2CON_MODE2                 3039
#define LC2INTN                       3040
#define CLC2CON_INTN                  3041
#define LC2INTP                       3042
#define CLC2CON_INTP                  3043
#define CLC2CON_OUT                   3044
#define LC2OUT                        3045
#define CLC2CON_EN                    3046
#define LC2EN                         3047
#define CLC2POL                       3048
#define LC2G1POL                      3049
#define CLC2POL_G1POL                 3050
#define LC2G2POL                      3051
#define CLC2POL_G2POL                 3052
#define LC2G3POL                      3053
#define CLC2POL_G3POL                 3054
#define LC2G4POL                      3055
#define CLC2POL_G4POL                 3056
#define CLC2POL_POL                   3057
#define LC2POL                        3058
#define CLC2SEL0                      3059
#define CLC2SEL0_D1S                  3060
#define LC2D1S0                       3061
#define CLC2SEL0_D1S0                 3062
#define LC2D1S                        3063
#define LC2D1S1                       3064
#define CLC2SEL0_D1S1                 3065
#define LC2D1S2                       3066
#define CLC2SEL0_D1S2                 3067
#define CLC2SEL0_D1S3                 3068
#define LC2D1S3                       3069
#define LC2D1S4                       3070
#define CLC2SEL0_D1S4                 3071
#define LC2D1S5                       3072
#define CLC2SEL0_D1S5                 3073
#define CLC2SEL1                      3074
#define LC2D2S0                       3075
#define CLC2SEL1_D2S0                 3076
#define LC2D2S                        3077
#define CLC2SEL1_D2S                  3078
#define LC2D2S1                       3079
#define CLC2SEL1_D2S1                 3080
#define LC2D2S2                       3081
#define CLC2SEL1_D2S2                 3082
#define LC2D2S3                       3083
#define CLC2SEL1_D2S3                 3084
#define LC2D2S4                       3085
#define CLC2SEL1_D2S4                 3086
#define LC2D2S5                       3087
#define CLC2SEL1_D2S5                 3088
#define CLC2SEL2                      3089
#define CLC2SEL2_D3S                  3090
#define LC2D3S0                       3091
#define CLC2SEL2_D3S0                 3092
#define LC2D3S                        3093
#define CLC2SEL2_D3S1                 3094
#define LC2D3S1                       3095
#define LC2D3S2                       3096
#define CLC2SEL2_D3S2                 3097
#define LC2D3S3                       3098
#define CLC2SEL2_D3S3                 3099
#define LC2D3S4                       3100
#define CLC2SEL2_D3S4                 3101
#define LC2D3S5                       3102
#define CLC2SEL2_D3S5                 3103
#define CLC2SEL3                      3104
#define LC2D4S0                       3105
#define CLC2SEL3_D4S                  3106
#define CLC2SEL3_D4S0                 3107
#define LC2D4S                        3108
#define LC2D4S1                       3109
#define CLC2SEL3_D4S1                 3110
#define LC2D4S2                       3111
#define CLC2SEL3_D4S2                 3112
#define CLC2SEL3_D4S3                 3113
#define LC2D4S3                       3114
#define LC2D4S4                       3115
#define CLC2SEL3_D4S4                 3116
#define LC2D4S5                       3117
#define CLC2SEL3_D4S5                 3118
#define CLC2GLS0                      3119
#define LC2G1D1N                      3120
#define CLC2GLS0_D1N                  3121
#define CLC2GLS0_D1T                  3122
#define LC2G1D1T                      3123
#define LC2G1D2N                      3124
#define CLC2GLS0_D2N                  3125
#define CLC2GLS0_D2T                  3126
#define LC2G1D2T                      3127
#define LC2G1D3N                      3128
#define CLC2GLS0_D3N                  3129
#define CLC2GLS0_D3T                  3130
#define LC2G1D3T                      3131
#define LC2G1D4N                      3132
#define CLC2GLS0_D4N                  3133
#define CLC2GLS0_D4T                  3134
#define LC2G1D4T                      3135
#define CLC2GLS1                      3136
#define CLC2GLS1_D1N                  3137
#define LC2G2D1N                      3138
#define CLC2GLS1_D1T                  3139
#define LC2G2D1T                      3140
#define CLC2GLS1_D2N                  3141
#define LC2G2D2N                      3142
#define CLC2GLS1_D2T                  3143
#define LC2G2D2T                      3144
#define LC2G2D3N                      3145
#define CLC2GLS1_D3N                  3146
#define LC2G2D3T                      3147
#define CLC2GLS1_D3T                  3148
#define LC2G2D4N                      3149
#define CLC2GLS1_D4N                  3150
#define LC2G2D4T                      3151
#define CLC2GLS1_D4T                  3152
#define CLC2GLS2                      3153
#define LC2G3D1N                      3154
#define CLC2GLS2_D1N                  3155
#define CLC2GLS2_D1T                  3156
#define LC2G3D1T                      3157
#define CLC2GLS2_D2N                  3158
#define LC2G3D2N                      3159
#define LC2G3D2T                      3160
#define CLC2GLS2_D2T                  3161
#define CLC2GLS2_D3N                  3162
#define LC2G3D3N                      3163
#define CLC2GLS2_D3T                  3164
#define LC2G3D3T                      3165
#define CLC2GLS2_D4N                  3166
#define LC2G3D4N                      3167
#define LC2G3D4T                      3168
#define CLC2GLS2_D4T                  3169
#define CLC2GLS3                      3170
#define LC2G4D1N                      3171
#define CLC2GLS3_G4D1N                3172
#define CLC2GLS3_G4D1T                3173
#define LC2G4D1T                      3174
#define CLC2GLS3_G4D2N                3175
#define LC2G4D2N                      3176
#define LC2G4D2T                      3177
#define CLC2GLS3_G4D2T                3178
#define CLC2GLS3_G4D3N                3179
#define LC2G4D3N                      3180
#define CLC2GLS3_G4D3T                3181
#define LC2G4D3T                      3182
#define LC2G4D4N                      3183
#define CLC2GLS3_G4D4N                3184
#define CLC2GLS3_G4D4T                3185
#define LC2G4D4T                      3186
#define STATUS_SHAD                   3187
#define C_SHAD                        3188
#define DC_SHAD                       3189
#define Z_SHAD                        3190
#define WREG_SHAD                     3191
#define BSR_SHAD                      3192
#define PCLATH_SHAD                   3193
#define FSR0L_SHAD                    3194
#define FSR0H_SHAD                    3195
#define FSR1L_SHAD                    3196
#define FSR1H_SHAD                    3197
#define STKPTR                        3198
#define TOSL                          3199
#define TOSH                          3200

#endif // _PIC16LF1614_H_
